{
  "@type" : "TEMPLATE",
  "uid" : "182d6bf7-b66a-40e2-89d1-1a7ff0264eb2",
  "description" : {
    "@type" : "RESOURCE_DESCRIPTION",
    "originalAuthor" : {
      "date" : "2023-03-27"
    },
    "otherContributors" : [ ],
    "lifecycleState" : {
      "codeString" : "unmanaged"
    },
    "ipAcknowledgements" : { },
    "references" : { },
    "conversionDetails" : { },
    "otherDetails" : {
      "licence" : "This work is licensed under the Creative Commons Attribution-ShareAlike 4.0 International License. To view a copy of this license, visit http://creativecommons.org/licenses/by-sa/4.0/.",
      "custodian_organisation" : "openEHR Foundation",
      "original_namespace" : "org.openehr",
      "original_publisher" : "openEHR Foundation",
      "custodian_namespace" : "org.openehr",
      "MD5-CAM-1.0.1" : "6da940d7e12214ab907305ca997f0718",
      "PARENT:MD5-CAM-1.0.1" : "8FE80F3E80C594AAF99D3BA540A53D73"
    },
    "details" : {
      "de" : {
        "@type" : "RESOURCE_DESCRIPTION_ITEM",
        "language" : {
          "terminologyId" : {
            "value" : "ISO_639-1"
          },
          "codeString" : "de"
        },
        "keywords" : [ ],
        "originalResourceUri" : { },
        "otherDetails" : { }
      },
      "sv" : {
        "@type" : "RESOURCE_DESCRIPTION_ITEM",
        "language" : {
          "terminologyId" : {
            "value" : "ISO_639-1"
          },
          "codeString" : "sv"
        },
        "keywords" : [ ],
        "originalResourceUri" : { },
        "otherDetails" : { }
      },
      "ru" : {
        "@type" : "RESOURCE_DESCRIPTION_ITEM",
        "language" : {
          "terminologyId" : {
            "value" : "ISO_639-1"
          },
          "codeString" : "ru"
        },
        "keywords" : [ ],
        "originalResourceUri" : { },
        "otherDetails" : { }
      },
      "nb" : {
        "@type" : "RESOURCE_DESCRIPTION_ITEM",
        "language" : {
          "terminologyId" : {
            "value" : "ISO_639-1"
          },
          "codeString" : "nb"
        },
        "keywords" : [ ],
        "originalResourceUri" : { },
        "otherDetails" : { }
      },
      "es-ar" : {
        "@type" : "RESOURCE_DESCRIPTION_ITEM",
        "language" : {
          "terminologyId" : {
            "value" : "ISO_639-1"
          },
          "codeString" : "es-ar"
        },
        "keywords" : [ ],
        "originalResourceUri" : { },
        "otherDetails" : { }
      },
      "pt-br" : {
        "@type" : "RESOURCE_DESCRIPTION_ITEM",
        "language" : {
          "terminologyId" : {
            "value" : "ISO_639-1"
          },
          "codeString" : "pt-br"
        },
        "keywords" : [ ],
        "originalResourceUri" : { },
        "otherDetails" : { }
      },
      "en" : {
        "@type" : "RESOURCE_DESCRIPTION_ITEM",
        "language" : {
          "terminologyId" : {
            "value" : "ISO_639-1"
          },
          "codeString" : "en"
        },
        "keywords" : [ ],
        "originalResourceUri" : { },
        "otherDetails" : { }
      },
      "sl" : {
        "@type" : "RESOURCE_DESCRIPTION_ITEM",
        "language" : {
          "terminologyId" : {
            "value" : "ISO_639-1"
          },
          "codeString" : "sl"
        },
        "keywords" : [ ],
        "originalResourceUri" : { },
        "otherDetails" : { }
      },
      "it" : {
        "@type" : "RESOURCE_DESCRIPTION_ITEM",
        "language" : {
          "terminologyId" : {
            "value" : "ISO_639-1"
          },
          "codeString" : "it"
        },
        "keywords" : [ ],
        "originalResourceUri" : { },
        "otherDetails" : { }
      },
      "fr" : {
        "@type" : "RESOURCE_DESCRIPTION_ITEM",
        "language" : {
          "terminologyId" : {
            "value" : "ISO_639-1"
          },
          "codeString" : "fr"
        },
        "keywords" : [ ],
        "originalResourceUri" : { },
        "otherDetails" : { }
      }
    }
  },
  "parentArchetypeId" : "openEHR-EHR-SECTION.adhoc.v1",
  "differential" : true,
  "archetypeId" : {
    "@type" : "ARCHETYPE_HRID",
    "value" : "openEHR-EHR-SECTION.substanceabuse.v1"
  },
  "definition" : {
    "@type" : "C_COMPLEX_OBJECT",
    "rmTypeName" : "SECTION",
    "nodeId" : "at0000.1",
    "attributes" : [ {
      "@type" : "C_ATTRIBUTE",
      "rmAttributeName" : "items",
      "existence" : "0..1",
      "cardinality" : {
        "@type" : "CARDINALITY",
        "interval" : "1..*",
        "ordered" : false,
        "unique" : false
      },
      "children" : [ {
        "@type" : "C_ARCHETYPE_ROOT",
        "rmTypeName" : "EVALUATION",
        "occurrences" : "0..1",
        "nodeId" : "at0.3",
        "attributes" : [ ],
        "attributeTuples" : [ ],
        "archetypeRef" : "openEHR-EHR-EVALUATION.ovl-tobacco_smoking_summary-001.v1",
        "referenceType" : "archetypeOverlay"
      }, {
        "@type" : "C_ARCHETYPE_ROOT",
        "rmTypeName" : "OBSERVATION",
        "occurrences" : "0..1",
        "nodeId" : "at0.15",
        "attributes" : [ ],
        "attributeTuples" : [ ],
        "archetypeRef" : "openEHR-EHR-OBSERVATION.ovl-substance_use_screening-003.v0",
        "referenceType" : "archetypeOverlay"
      }, {
        "@type" : "C_ARCHETYPE_ROOT",
        "rmTypeName" : "OBSERVATION",
        "occurrences" : "0..1",
        "nodeId" : "at0.14",
        "attributes" : [ ],
        "attributeTuples" : [ ],
        "archetypeRef" : "openEHR-EHR-OBSERVATION.ovl-substance_use_screening-002.v0",
        "referenceType" : "archetypeOverlay"
      }, {
        "@type" : "C_ARCHETYPE_ROOT",
        "rmTypeName" : "OBSERVATION",
        "occurrences" : "0..1",
        "nodeId" : "at0.7",
        "attributes" : [ ],
        "attributeTuples" : [ ],
        "archetypeRef" : "openEHR-EHR-OBSERVATION.ovl-substance_use_screening-001.v0",
        "referenceType" : "archetypeOverlay"
      } ]
    } ],
    "attributeTuples" : [ ]
  },
  "terminology" : {
    "@type" : "ARCHETYPE_TERMINOLOGY",
    "conceptCode" : "at0000",
    "termDefinitions" : {
      "en" : {
        "at0000.1" : {
          "@type" : "ARCHETYPE_TERM",
          "code" : "at0000.1",
          "text" : "Substance abuse",
          "description" : "A generic section header which should be renamed in a template to suit a specific clinical context."
        }
      },
      "ru" : {
        "at0000.1" : {
          "@type" : "ARCHETYPE_TERM",
          "code" : "at0000.1",
          "text" : "заготовка заголовка (16)",
          "description" : "Образец заголовка раздела"
        }
      },
      "es-ar" : {
        "at0000.1" : {
          "@type" : "ARCHETYPE_TERM",
          "code" : "at0000.1",
          "text" : "Encabezado ad hoc (16)",
          "description" : "Un encabezado de sección de tipo genérico que será renombrado en una plantilla para su empleo en un contexto clínico específico."
        }
      },
      "sl" : {
        "at0000.1" : {
          "@type" : "ARCHETYPE_TERM",
          "code" : "at0000.1",
          "text" : "Naslov sekcije (16)",
          "description" : "Naslov sekcije"
        }
      },
      "nb" : {
        "at0000.1" : {
          "@type" : "ARCHETYPE_TERM",
          "code" : "at0000.1",
          "text" : "Templat-overskrift (16)",
          "description" : "En generisk seksjonsoverskrift som skal gis nytt navn i en templat for å passe i en gitt klinisk kontekst."
        }
      },
      "pt-br" : {
        "at0000.1" : {
          "@type" : "ARCHETYPE_TERM",
          "code" : "at0000.1",
          "text" : "Cabeçalho Ad hoc (16)",
          "description" : "Um cabeçalho de sessão genérico que deve ser renomeado no template para adequar-se a um contexto clínico específico."
        }
      },
      "sv" : {
        "at0000.1" : {
          "@type" : "ARCHETYPE_TERM",
          "code" : "at0000.1",
          "text" : "Rubrik (16)",
          "description" : "En allmän avsnittsrubrik som döps om i en openEHR-mall för att passa in i en specifik klinisk kontext."
        }
      },
      "de" : {
        "at0000.1" : {
          "@type" : "ARCHETYPE_TERM",
          "code" : "at0000.1",
          "text" : "Ad hoc Überschrift (16)",
          "description" : "Eine generische Abschnittsüberschrift eines Templates, welche entsprechend dem spezifischen klinischen Kontext umbenannt werden sollte."
        }
      },
      "it" : {
        "at0000.1" : {
          "@type" : "ARCHETYPE_TERM",
          "code" : "at0000.1",
          "text" : "Intestazione di sezione ad hoc (16)",
          "description" : "Un'intestazione di sezione generica che dovrebbe essere rinominata in un template per adattarsi ad uno specifico contesto clinico."
        }
      },
      "fr" : {
        "at0000.1" : {
          "@type" : "ARCHETYPE_TERM",
          "code" : "at0000.1",
          "text" : "Rubrique ad hoc (16)",
          "description" : "Un en-tête de section générique qui doit être renommé dans un modèle pour s'adapter à un contexte clinique spécifique."
        }
      }
    },
    "termBindings" : { },
    "terminologyExtracts" : { },
    "valueSets" : { }
  },
  "adlVersion" : "1.4",
  "buildUid" : "bb5d3289-4f10-32ce-a0ce-98793b64ce1c",
  "rmName" : "openehr",
  "rmRelease" : "1.1.0",
  "generated" : true,
  "templateId" : "Substance abuse",
  "otherMetaData" : { },
  "templateOverlays" : [ {
    "@type" : "TEMPLATE_OVERLAY",
    "uid" : "d553d1da-c528-4f42-9012-f98f5a448632",
    "description" : {
      "@type" : "RESOURCE_DESCRIPTION",
      "originalAuthor" : { },
      "otherContributors" : [ ],
      "ipAcknowledgements" : { },
      "references" : { },
      "conversionDetails" : { },
      "otherDetails" : {
        "PARENT:MD5-CAM-1.0.1" : "2652A8203C37B165FD58EC69634FFBF6"
      },
      "details" : {
        "de" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "de"
          },
          "purpose" : "Zur Darstellung zusammenfassender Informationen über das individuelle Rauchverhalten von Tabak und tabakhaltigen Produkten.",
          "keywords" : [ "Tabak", "Zigarette", "Zigarre", "Pfeife", "rauchen", "Raucher", "Zigarillo", "Wasserpfeife", "Shisha", "handgedrehte Zigaretten", "hookah", "Narguileh", "hubble-bubble", "roll-up", "rollie", "kretek", "beedi", "bidi", "Nelkenzigarette" ],
          "use" : "Zur Darstellung zusammenfassender Informationen über das individuelle Rauchverhalten von Tabak und tabakhaltigen Produkten. \r\n\r\nDieser Archetyp soll genutzt werden, um Informationen über das aktuelle und frühere Rauchverhalten darzustellen.\r\n\r\nDer spezifische Anwendungsbereich dieses Archetyps liegt in der Dokumentation über die Verwendung aller Arten von inhaliertem Tabakrauch aufgrund der damit verbundenen Gesundheitsrisiken durch das direkte Einatmen von Tabak und damit verbundenen Chemikalien. Die Menge an Nikotin und Teer und die Verwendung von Filtern und Additiven wurden für den Kernarchetyp nicht berücksichtigt, könnten aber bei Bedarf in den Episoden-SLOT aufgenommen werden. Bitte beachten Sie, dass der Anwendungsbereich dieses Archetyps keine unbeabsichtigte Exposition gegenüber Tabakrauch umfasst (siehe Missbrauch). \r\n\r\nDer Cluster \"Pro Art\" von Datenelementen ermöglicht die Aufzeichnung von spezifischen Details und Episoden über jede Art von Tabak und kann einmal pro Art wiederholt werden. \r\n\r\nIn vielen Situationen raucht der Einzelne nur eine Art von Tabak, wie z.B. Zigaretten. Werden andere Arten von Tabak geraucht, werden die Details in einer anderen Instanz des Clusters \"Pro Art\" aufgezeichnet.\r\n\r\nDie Entwicklung des zu- und abnehmenden Gebrauchs für jede Art von Tabak im Laufe der Zeit kann mit dem wiederholbaren Cluster \"Pro Episode\" dargestellt werden. Diese Gruppe von Datenelementen ermöglicht es, ein sehr detailliertes Muster des Rauchverhaltens für jede Art von Tabak darzustellen, wie z.B. das tägliche Rauchen von selbstgedrehten Zigaretten, neben dem wöchentlichen Rauchen von Zigarren jeden Freitagabend und dem gelegentlichen Bidi-Rauchen im Urlaub auf Bali. \r\n\r\nAuslöser für das Ende einer Episode und den Beginn einer neuen Episode spiegeln weitgehend die lokalen Datenerfassungspräferenzen wider, einschließlich wenn die Person: \r\n- für einen längeren Zeitraum (der wahrscheinlich lokal definiert wird) das Rauchen aufgibt; oder\r\n- ihre Nutzung oder ihr Rauchverhalten signifikant verändert.\r\n\r\nWenn nur eine Tabakart geraucht wird, ist der Wert für \"Packungsjahre\" identisch mit dem im Datenelement \"Packungsjahre gesamt\". Wenn mehr als eine Tabakart geraucht wird, erfordert die Berechnung des Wertes für \"Packungsjahre gesamt\" einen komplexeren Algorithmus wie http://smokingpackyears.com/.\r\n\r\nDas Datenelemet \"Allgemeine Beschreibung\" wird verwendet, um die Beschreibungen der Tabakrauchgewohnheiten in bestehenden oder älteren klinischen Systemen in ein Archetypenformat zu übertragen.\r\n\r\nAchtung: Die Definition \"Derzeitiger Raucher\" kann variieren. Zum Beispiel: das CDC verwendet einen Monat / 31 Tage als Grenzwert, während es in Neuseeland 28 Tage sind.",
          "misuse" : "Nicht zur Darstellung von ereignis- oder zeitabhängigen Informationen über das Rauchen, wie z.B. dem tatsächlichen täglichen Gebrauch oder dem durchschnittlichen Gebrauch über einen bestimmten Zeitraum - verwenden Sie den Archetyp OBSERVATION.tobacco_smoking.\r\n\r\nNicht zur Darstellung von Informationen über rauchfreien Tabakkonsum - zum Beispiel: Schnupftabak; Kautabak; Dip; und Gutka. Verwenden Sie dazu den Archetyp EVALUATION.smokeless_tobacco_summary.\r\n\r\nNicht zur Darstellung einer Beurteilung der Zigaretten- oder Nikotinabhängigkeit verwenden. Verwenden Sie dazu den Archetyp OBSERVATION.fagerstrom.\r\n\r\nNicht zur Darstellung von Details über unbeabsichtigte Exposition gegenüber Tabakrauch oder Passivrauchen verwenden. Verwenden Sie dazu den Archetyp EVALUATION.exposure.\r\n\r\nNicht zur Darstellung von anderen Verabreichungen von Nikotin wie e-Zigaretten, Nikotinpflaster oder Nikotinkaugummi. Verwenden sie einen separaten Archetyp für diesen Zweck.",
          "originalResourceUri" : { },
          "otherDetails" : { }
        },
        "sv" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "sv"
          },
          "purpose" : "Att registrera sammanfattande information om rökvanor gällande tobak och produkter som innehåller tobak.",
          "keywords" : [ "rökning", "rökanamnes", "tobak", "cigarett", "cigarr", "pipa", "kretek", "bidi", "cigarill", "rökare", "vattenpipa", "shisha", "hookah", "narguileh", "n'arghile", "ghelion", "bong", "rulltobak" ],
          "use" : "Används för att beskriva sammanfattad information om individens rökvanor gällande tobak och tobaks-innehållande produkter.\r\n\r\nDenna arketyp kan användas för att beskriva både nuvarande och tidigare rökvanor.\r\n\r\nArketypen omfattar dokumentation av rökvanor för alla sorters tobaksbruk där man andas in tobaksröken eftersom det finns specifika hälsorisker associerade till direkt inandning av tobaksrök och tillhörande kemikalier. \r\n\r\nMängden nikotin och tjära, användning av filter och tillsatser har lämnats utanför vad kärnan av arketypen omfattar, men kan t.ex. läggas till (med hjälp av ytterligare arketyper) under rubriken \"Episoddetaljer\"\r\n\r\nObservera att denna arketyp inte omfattar oavsiktlig exponering för tobaksrök (se \"Misuse\"/felaktig användning).\r\n\r\nI många fall kommer individen bara röka en typ av tobak, till exempel vanliga cigaretter. Om flera sorters tobaksprodukter röks så repeteras \"Per typ\"-delträdet (\"cluster\") på ett sätt som gör det möjligt att registrera specifika detaljer och episoder om varje typ av tobak som röks. Det kan upprepas för varje typ som behöver dokumenteras. \r\n\r\nAtt rökvanor varierar i omfattning och typ av rökning kan fångas med det repeterbara \"Per episod\"-klustret (delträdet). Detta kluster av dataelement gör det möjligt att beskriva mönster av rökvanor mycket detaljerat för varje typ av tobak som röks, exempelvis daglig rökning av handrullade cigaretter, kombinerat med veckovis cigarrrökning varje fredagskväll och ibland Bidi-rökning på semester på Bali.\r\n\r\nAnledningar för att stänga en episod och starta en ny kommer i hög grad att återspegla lokala datainsamlingspreferenser, inklusive om personen:\r\n- slutar röka under en betydande tidsperiod (vilket sannolikt kommer att vara lokalt definierat) eller\r\n- signifikant ändrar rökmönster eller mängd\r\n\r\nOm endast en typ av tobak rökts, kommer värdet för \"Paketår\" att vara identiskt med värdet för \"Totala paketår\". Om mer än en typ av tobak har rökts så kommer beräkningen för värdet för \"Totala paketår\" att kräva en mer komplex algoritm, exempelvis från http://smokingpackyears.com/.\r\n\r\nFör att införliva beskrivande information (t.ex. fritext) om rökvanor från befintliga eller gamla vård-IT-system till arketyp-baserade system, används lämpligen dataelementet \"Övergripande beskrivning\".\r\n\r\nNotera att definitionen av \"rökare\" och \"före detta rökare\" t.ex. kan variera avseende perioder. Exempelvis använder amerikanska CDC 1 månad/31 dagar och nya Zealand använder 28 dagar.",
          "misuse" : "Använd inte denna arketyp för att registrera specifik händelse- eller periodbaserad information om rökning, till exempel faktisk daglig användning eller genomsnittlig användning under en viss tidsperiod - använd då istället arketypen OBSERVATION.tobacco_smoking\r\n\r\nAnvänd inte denna arketyp för att registrera information om rökfri tobaksanvändning, exempelvis snus, tuggtobak eller gutka - använd då istället arketypen EVALUATION.smokeless_tobacco_summary\r\n\r\nAnvänd inte denna arketyp för att registrera evidens eller bedömning av cigarett- eller nikotinberoende. Använd då istället arketypen OBSERVATION.fagerstrom\r\n\r\nAnvänd inte denna arketyp för att registrera detaljer om oavsiktilg tobaksröksexponering eller passiv rökning. Använd då istället arketypen EVALUATION.exposure.\r\n\r\nAnvänd inte denna arketyp för att registrera annat nikotinbruk, exempelvis e-cigaretter, nikotinplåster eller nikotintuggummi. Använd separata arketyper för de ändamålen.",
          "originalResourceUri" : { },
          "otherDetails" : { }
        },
        "nb" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "nb"
          },
          "purpose" : "For å registrere et sammendrag om individets mønster for røyking av tobakk og produkter som inneholder tobakk.",
          "keywords" : [ "tobakk", "sigarett", "sigar", "pipe", "røyking", "kretek", "beedi", "bidi", "sigarillo", "røyker", "vannpipe", "shisha", "hookah", "narguileh", "rulletobakk", "rullings", "røyk" ],
          "use" : "Brukes for å registrere et sammendrag om individets mønster for røyking av tobakk og produkter som inneholder tobakk.\r\n\r\nDenne arketypen brukes for å registrere både nåværende og tidligere tobakksrøyking.\r\n\r\nArketypen fokuserer spesifikt på dokumentasjon om bruk av alle typer inhalert tobakksrøyk, på grunn av helserisikoen knyttet til inhalering og kjemikaliene tilknyttet dette. Mengden av nikotin og tjære, filterbruk og tilsetningstoffer er ikke dekket av arketypen, men kan legges til i SLOTet \"Episodedetaljer\" ved behov. Arketypen omfatter ikke utilsiktet eksponering for tobakksrøyk (se Feil bruk).\r\n\r\nClusteret \"Per type\" tillater registrering av spesifikke detaljer og episoder om hver enkelt ulik type tobakk som røykes og kan repeteres en gang per type. \r\n\r\nI mange tilfeller vil individet bare røyke en type tobakk, for eksempel filtersigaretter. Røykes også andre typer tobakk, legges detaljene om dette i en annen instans av Clusteret \"Per type\".\r\n\r\nHistorikken knyttet til økt eller redusert bruk av hver enkelt tobakkstype over tid kan registreres ved å bruke Clusteret \"Per episode\". Denne samlingen av dataelementer åpner for en veldig detaljert registrering av røykeadferd, for eksempel kan en registrere at man daglig røyker rullings, en sigar hver fredag og Bidi-røyking når man er på ferie på Bali.\r\n\r\nHva som trigger en avslutning av en episode og start av en ny avhenger av behovet, for eksempel:\r\n- Individet slutter å røyke en periode (kan defineres lokalt).\r\n- Betydningsfulle endringer i mengde eller røykemønster.\r\n\r\nRøyker individet kun en type tobakk vil verdien for dataelementet \"Pakkeår\" være identisk med dataelementet \"Overordnet pakkeår\". Røykes mer enn en type tobakk vil kalkulasjonen av verdien for \"Overordnet pakkeår\" kreve en mer kompleks algoritme som http://smokingpackyears.com/.\r\n\r\nDataelementet \"Overordnet beskrivelse\" brukes til å overføre fritekstbeskrivelser fra eksisterende eller tidligere kliniske systemer til arketypeformat.\r\n\r\nMerk: Definisjon av verdien \"Røyker\" i dataelementet \"Status\" kan variere fra land til land. For eksempel refererer USAs Center for Disease Control til røyking den siste måneden, og New Zealand Ministry of Health til røyking i løpet av de siste 28 dagene.",
          "misuse" : "Brukes ikke for å registrere informasjon som ikke handler om tobakksrøyking eller som handler om tobakk blandet med andre rusmidler, bruk egne arketyper for dette formålet.\r\n\r\nBrukes ikke for å registrere hendelses- eller periodisk informasjon om tobakksrøyking, for eksempel: faktisk daglig bruk eller gjennomsnittlig bruk over en spesifisert tidsperiode. Bruk arketypen OBSERVATION.tobacco_smoking for dette formålet.\r\n\r\nBrukes ikke for å registrere informasjon om bruk av røykfri tobakk, for eksempel snus, luktsnus/snuff, tyggetobakk, dip og gutka. Bruk arketypen EVALUATION.smokeless_tobacco_summary for dette formålet.\r\n\r\nBrukes ikke for å registrere informasjon om nikotinavhengighet. Bruk arketypen OBSERVATION.fagerstrom til dette formålet.\r\n\r\nBrukes ikke for å registrere detaljer om passiv røyking. Bruk arketypen EVALUATION.exposure for dette formålet.\r\n\r\nBrukes heller ikke for annen tilførsel av nikotin som e-sigarett, nikotinplaster eller niktotintyggegummi. Bruk egne arketyper for dette formålet.",
          "originalResourceUri" : { },
          "otherDetails" : { }
        },
        "en" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "en"
          },
          "purpose" : "To record summary information about the individual's pattern of smoking of tobacco and tobacco-containing products.",
          "keywords" : [ "tobacco", "cigarette", "cigar", "pipe", "smoking", "kretek", "beedi", "bidi", "cigarillo", "smoker", "waterpipe", "shisha", "hookah", "narguileh", "hubble-bubble", "roll-up", "RYO", "rollie", "roll-your-own" ],
          "use" : "Use to record summary information about the individual's pattern of smoking of tobacco and tobacco-containing products.\r\n\r\nThis archetype is to be used to record information about both current and previous smoking behaviour.\r\n\r\nThe specific scope of this archetype is on documentation about the use of all types of inhaled tobacco smoke because of the associated health risks from direct inhalation of tobacco and associated chemicals. Amount of nicotine and tar, use of filters and additives has been left outside of scope for the core archetype, but could be added into the Episode SLOT if required. Please note that the scope of this archetype does not include unintentional exposure to tobacco smoke (see Misuse). \r\n\r\nThe 'Per type' cluster of data elements allows for recording of specific details and episodes about each type of tobacco smoked and can be repeated once per type.\r\n\r\nIn many situations the individual will only smoke one type of tobacco, such as manufactured cigarettes.  If other types of tobacco are smoked, the details will be recorded in another instance of the 'Per type' cluster.\r\n\r\nThe history of waxing and waning of use for each type of tobacco over time can be captured using the repeatable 'Per episode' cluster. This cluster of data elements allows for a very detailed pattern of smoking behaviour to be recorded for each type of tobacco smoked such as daily 'roll-your-own' cigarette smoking, alongside weekly cigar smoking every Friday night and occasional Bidi smoking while on holiday in Bali. \r\n\r\nTriggers for closing one episode and commencing a new one will largely reflect local data collection preferences, including if the individual: \r\n- quits for a significant period of time (which will likely be locally defined); or\r\n- significantly changes their amount of use or pattern of their smoking.\r\n\r\nIf only one type of tobacco is smoked, the value for 'Pack years' will be identical to the 'Overall pack years' data element. If more than one type of tobacco is smoked, the calculation for the value for 'Overall pack years' will require a more complex algorithm such as http://smokingpackyears.com/.\r\n\r\nUse to incorporate the narrative descriptions of tobacco smoking habits within existing or legacy clinical systems into an archetyped format, using the 'Overall description' data element.\r\n\r\nNote: Definitions of 'Current smoker' may vary. For example: the CDC uses 1 month/31 days and New Zealand uses 28 days.",
          "misuse" : "Not to be used to record event-or period-based information about tobacco smoking, such as actual daily use or the average use over a specified period of time - use the OBSERVATION.tobacco_smoking archetype.\r\n\r\nNot to be used to record information about smokeless tobacco use - for example: snus; snuff; chewing tobacco; dip; and gutka. Use the archetype EVALUATION.smokeless_tobacco_summary archetype for this purpose.\r\n\r\nNot to be used to record evidence of nicotine dependency. Use the OBSERVATION.fagerstrom for this purpose.\r\n\r\nNot to be used to record details about unintended exposure to tobacco smoke or passive smoking. Use the archetype EVALUATION.exposure for this purpose.\r\n\r\nNot to be used for recording any other administration of nicotine, such as e-cigarettes, nicotine patches or nicotine chewing gum. Use separate archetypes for this purpose.",
          "copyright" : "© openEHR Foundation, Australian Digital Health Agency, Nasjonal IKT (Norway)",
          "originalResourceUri" : { },
          "otherDetails" : { }
        },
        "fr" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "fr"
          },
          "purpose" : "*To record summary information about the individual's pattern of smoking of tobacco and tobacco-containing products.(en)",
          "keywords" : [ "le tabac", "cigarette", "cigare", "tuyau", "fumeur", "kretek", "beedi", "bidi", "cigarillo", "fumeur", "conduite d'eau", "chicha", "narguilé", "narguileh", "hubble-bubble", "enrouler", "RYO", "Rollie", "roule toi-même" ],
          "use" : "*Use to record summary information about the individual's pattern of smoking of tobacco and tobacco-containing products.\r\n\r\nThis archetype is to be used to record information about both current and previous smoking behaviour.\r\n\r\nThe specific scope of this archetype is on documentation about the use of all types of inhaled tobacco smoke because of the associated health risks from direct inhalation of tobacco and associated chemicals. Amount of nicotine and tar, use of filters and additives has been left outside of scope for the core archetype, but could be added into the Episode SLOT if required. Please note that the scope of this archetype does not include unintentional exposure to tobacco smoke (see Misuse). \r\n\r\nThe 'Per type' cluster of data elements allows for recording of specific details and episodes about each type of tobacco smoked and can be repeated once per type.\r\n\r\nIn many situations the individual will only smoke one type of tobacco, such as manufactured cigarettes. If other types of tobacco are smoked, the details will be recorded in another instance of the 'Per type' cluster.\r\n\r\nThe history of waxing and waning of use for each type of tobacco over time can be captured using the repeatable 'Per episode' cluster. This cluster of data elements allows for a very detailed pattern of smoking behaviour to be recorded for each type of tobacco smoked such as daily 'roll-your-own' cigarette smoking, alongside weekly cigar smoking every Friday night and occasional Bidi smoking while on holiday in Bali. \r\n\r\nTriggers for closing one episode and commencing a new one will largely reflect local data collection preferences, including if the individual: \r\n- quits for a significant period of time (which will likely be locally defined); or\r\n- significantly changes their amount of use or pattern of their smoking.\r\n\r\nIf only one type of tobacco is smoked, the value for 'Pack years' will be identical to the 'Overall pack years' data element. If more than one type of tobacco is smoked, the calculation for the value for 'Overall pack years' will require a more complex algorithm such as http://smokingpackyears.com/.\r\n\r\nUse to incorporate the narrative descriptions of tobacco smoking habits within existing or legacy clinical systems into an archetyped format, using the 'Overall description' data element.\r\n\r\nNote: Definitions of 'Current smoker' may vary. For example: the CDC uses 1 month/31 days and New Zealand uses 28 days.(en)",
          "misuse" : "*Not to be used to record event-or period-based information about tobacco smoking, such as actual daily use or the average use over a specified period of time - use the OBSERVATION.tobacco_smoking archetype.\r\n\r\nNot to be used to record information about smokeless tobacco use - for example: snus; snuff; chewing tobacco; dip; and gutka. Use the archetype EVALUATION.smokeless_tobacco_summary archetype for this purpose.\r\n\r\nNot to be used to record evidence of nicotine dependency. Use the OBSERVATION.fagerstrom for this purpose.\r\n\r\nNot to be used to record details about unintended exposure to tobacco smoke or passive smoking. Use the archetype EVALUATION.exposure for this purpose.\r\n\r\nNot to be used for recording any other administration of nicotine, such as e-cigarettes, nicotine patches or nicotine chewing gum. Use separate archetypes for this purpose.(en)",
          "originalResourceUri" : { },
          "otherDetails" : { }
        },
        "nl" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "nl"
          },
          "purpose" : "Voor het vastleggen van samenvattende informatie over een individu's gedrag in het roken van tabak en tabak-bevattende producten.",
          "keywords" : [ "tabak", "sigaretten", "sigaar", "pijp", "roken", "kretek", "beedi", "bidi", "cigarillo", "roker", "waterpijp", "shisha", "hookah", "narguileh", "hubble-bubble", "roll-up", "sjek", "roltabak", "shag" ],
          "use" : "Gebruik voor het vastleggen van samenvattende informatie over een individu's gedrag in het roken van tabak en tabak-bevattende producten.\r\n\r\nDit archetype dient gebruikt te worden om informatie over zowel het huidige als het voormalige rookgedrag vast te leggen.\r\n\r\nDe strekking van dit archetype is het vastleggen van het gebruik van alle typen geïnhaleerde tabaksrook in verband met de bijgaande gezondheidsrisico's bij het direct inademen van tabak en aanverwante chemicaliën. Hoeveelheid nicotine en teer, gebruik van filters en toevoegingen zijn buiten de scope van dit kernarchetype, maar kunnen in het Episode SLOT toegevoegd worden indien nodig. Merk op dat dit archetype onbedoelde blootstelling aan tabaksrook buiten beschouwing laat (zie Misuse).\r\n\r\nHet 'Per type' cluster met data elementen staat het vastleggen van specifieke details en episodes over ieder type tabak toe, en kan herhaald worden voor ieder type.\r\n\r\nIn veel gevallen rookt een individu maar één type tabak, zoals bijvoorbeeld gefabriceerde sigaretten. Als andere typen tabak worden gerookt, zullen de details hiervan vastgelegd worden in een andere instantie van het 'Per type' cluster.\r\n\r\nDe geschiedenis van toename en afname van het gebruik van elk type tabak door de tijd heen kan vastgelegd worden door het herhaalbare 'Per episode' cluster te gebruiken. Dit cluster met data elementen staat toe om een zeer gedetaileerd patroon van rookgedrag vast te leggen voor elk type tabak. Bijvoorbeeld dagelijkse 'roll-your-own' sigaretten, in combinatie met weekelijks sigaarroken op vrijdagavond en het af-en-toe roken van een Bidi gedurende vakantie op Bali.\r\n\r\nHet sluiten van een episode en starten van een nieuwe episode hangt af van hoe men lokaal de data wenst te verzamelen, en of het individu:\r\n- voor een significante tijd gestopt is (waarbij de definitie lokaal vastgesteld is); of\r\n- significante veranderingen in het patroon of de hoeveelheid van het rookgedrag vertoont.\r\n\r\nAls er maar één type tabak gerookt wordt, dan is de waarde voor 'Packyears' gelijk aan de waarde voor het 'Totaal aantal packyears' data element. Als meerdere typen tabak gerookt zijn, dan vereist de 'Totaal aantal packyears' berekening een complexer algoritme zoals beschreven op http://smokingpackyears.com/.\r\n\r\nGebruik om de aanvullende beschrijvingen van tabak rookgedrag in bestaande of legacy klinische systemen in een archetype-formaat te vatten doormiddel van het 'Algemene beschrijving' data element.\r\n\r\nNoot: de definitie van 'huidige roker' kan veriëren. Bijvoorbeeld, het CDC gebruikt 1 maand/31 dagen, terwijl men in Nieuw Zeeland 28 dagen hanteert.",
          "misuse" : "Niet te gebruiken voor het vastleggen van gebeurtenis- of periode-gebasseerde informatie over het roken van tabak, zoals de daadwerkelijke dagelijkse dosis of het gemiddelde gebruik over een bepaalde periode - gebruik hiervoor het OBSERVATION.tobacco_smoking archetype.\r\n\r\nNiet te gebruiken voor het vastleggen van informatie over het gebruik van rookloos tabak - zoals bijvoorbeeld: snus; snuiftabak; pruimtabak; dip; and gutka. Gebruik hiervoor het archetype EVALUATION.smokeless_tobacco_summary.\r\n\r\nNiet te gebruiken voor het vastleggen van bewijs voor nicotineafhankelijkheid. Gebruik hiervoor het archetype OBSERVATION.fagerstrom.\r\n\r\nNiet te gebruiken voor het vastleggen van onbedoelde blootstelling aan tabaksrook of passief roken. Gebruik hiervoor het archetype EVALUATION.exposure.\r\n\r\nNiet te gebruiken voor het vastleggen van enige andere vorm van toediening van nicotine, zoals e-cigaretten, nicotine pleisters of nicotine kauwgom. Gebruik hiervoor losstaande archetypes.",
          "originalResourceUri" : { },
          "otherDetails" : { }
        }
      }
    },
    "annotations" : {
      "@type" : "RESOURCE_ANNOTATIONS",
      "documentation" : {
        "en" : {
          "/data[at0001]/items[at0089]" : {
            "redcap_mapping" : "tobacco_suncf"
          },
          "/data[at0001]/items[at0016]" : {
            "redcap_mapping" : "overall_suendat"
          },
          "/data[at0001]/items[at0029]/items[at0064]/items[at0013.1]" : {
            "redcap_mapping" : "cigarettes_sustdat, shisha_sustdat, cigar_sustdat, tobacco_chews_sustdat, ecigarettes_sustdat"
          },
          "/data[at0001]/items[at0029]/items[at0064]/items[at0082.1]" : {
            "redcap_mapping" : "cigarettes_suendat, shisha_sustdat, cigar_sustdat, tobacco_chews_sustdat, ecigarettes_sustdat"
          },
          "/data[at0001]/items[at0029]/items[at0064]/items[at0023]" : {
            "redcap_mapping" : "cigarettes_sudosfrq, shisha_sudosfrq, cigar_sudosfrq, tobacco_chews_sudosfrq, ecigarettes_sudosfrq"
          },
          "/data[at0001]/items[at0029]/items[at0095.1]" : {
            "redcap_mapping" : "tobacco_sutrt"
          },
          "/data[at0001]/items[at0093.1]" : {
            "redcap_mapping" : "overall_sucdur"
          },
          "/data[at0001]/items[at0080.1]" : {
            "redcap_mapping" : "overall_sustdat"
          },
          "/data[at0001]/items[at0029]/items[at0017.1]" : {
            "redcap_mapping" : "cigarettes_sucdur, shisha_sucdur, cigar_sucdur, tobacco_chews_sucdur, ecigarettes_sucdur"
          }
        }
      }
    },
    "parentArchetypeId" : "openEHR-EHR-EVALUATION.tobacco_smoking_summary.v1",
    "differential" : true,
    "archetypeId" : {
      "@type" : "ARCHETYPE_HRID",
      "value" : "openEHR-EHR-EVALUATION.ovl-tobacco_smoking_summary-001.v1"
    },
    "definition" : {
      "@type" : "C_COMPLEX_OBJECT",
      "rmTypeName" : "EVALUATION",
      "nodeId" : "at0000.1",
      "attributes" : [ {
        "@type" : "C_ATTRIBUTE",
        "rmAttributeName" : "data",
        "children" : [ {
          "@type" : "C_COMPLEX_OBJECT",
          "rmTypeName" : "ITEM_TREE",
          "nodeId" : "at0001",
          "attributes" : [ {
            "@type" : "C_ATTRIBUTE",
            "rmAttributeName" : "items",
            "children" : [ {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "ELEMENT",
              "occurrences" : "0..0",
              "nodeId" : "at0043.1",
              "attributes" : [ ],
              "attributeTuples" : [ ]
            }, {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "ELEMENT",
              "occurrences" : "0..0",
              "nodeId" : "at0015.1",
              "attributes" : [ ],
              "attributeTuples" : [ ]
            }, {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "ELEMENT",
              "nodeId" : "at0080.1",
              "attributes" : [ ],
              "attributeTuples" : [ ]
            }, {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "CLUSTER",
              "nodeId" : "at0029",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "items",
                "children" : [ {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "ELEMENT",
                  "nodeId" : "at0095.1",
                  "attributes" : [ {
                    "@type" : "C_ATTRIBUTE",
                    "rmAttributeName" : "value",
                    "children" : [ {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "DV_CODED_TEXT",
                      "attributes" : [ {
                        "@type" : "C_ATTRIBUTE",
                        "rmAttributeName" : "defining_code",
                        "children" : [ {
                          "@type" : "C_TERMINOLOGY_CODE",
                          "rmTypeName" : "TERMINOLOGY_CODE",
                          "occurrences" : "1..1",
                          "terminologyId" : {
                            "value" : "SNOMED-CT"
                          },
                          "constraint" : [ ],
                          "selectedTerminologies" : [ "SNOMED-CT" ],
                          "includedExternalTerminologyCodes" : [ {
                            "terminologyId" : "SNOMED-CT",
                            "code" : "722496004",
                            "value" : "Cigarette"
                          }, {
                            "terminologyId" : "SNOMED-CT",
                            "code" : "722495000",
                            "value" : "Shisha (Hookahpipe,Waterpipe,Hubble-bubble,Narguileh)"
                          }, {
                            "terminologyId" : "SNOMED-CT",
                            "code" : "722497008",
                            "value" : "Cigar"
                          }, {
                            "terminologyId" : "SNOMED-CT",
                            "code" : "81911001",
                            "value" : "Chewing tobacco"
                          }, {
                            "terminologyId" : "SNOMED-CT",
                            "code" : "722498003",
                            "value" : "Electronic cigarette"
                          } ]
                        } ]
                      } ],
                      "attributeTuples" : [ ]
                    } ]
                  } ],
                  "attributeTuples" : [ ]
                }, {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "ELEMENT",
                  "occurrences" : "0..0",
                  "nodeId" : "at0052.1",
                  "attributes" : [ {
                    "@type" : "C_ATTRIBUTE",
                    "rmAttributeName" : "value",
                    "children" : [ {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "DV_CODED_TEXT",
                      "attributes" : [ {
                        "@type" : "C_ATTRIBUTE",
                        "rmAttributeName" : "defining_code",
                        "children" : [ {
                          "@type" : "C_TERMINOLOGY_CODE",
                          "rmTypeName" : "TERMINOLOGY_CODE",
                          "occurrences" : "1..1",
                          "terminologyId" : {
                            "value" : "local"
                          },
                          "constraint" : [ "ac0.1" ],
                          "selectedTerminologies" : [ ]
                        } ]
                      } ],
                      "attributeTuples" : [ ]
                    } ]
                  } ],
                  "attributeTuples" : [ ]
                }, {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "ELEMENT",
                  "occurrences" : "0..0",
                  "nodeId" : "at0053.1",
                  "attributes" : [ ],
                  "attributeTuples" : [ ]
                }, {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "CLUSTER",
                  "nodeId" : "at0064",
                  "attributes" : [ {
                    "@type" : "C_ATTRIBUTE",
                    "rmAttributeName" : "items",
                    "children" : [ {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "ELEMENT",
                      "occurrences" : "0..0",
                      "nodeId" : "at0081.1",
                      "attributes" : [ {
                        "@type" : "C_ATTRIBUTE",
                        "rmAttributeName" : "value",
                        "children" : [ {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "DV_COUNT",
                          "attributes" : [ {
                            "@type" : "C_ATTRIBUTE",
                            "rmAttributeName" : "magnitude",
                            "children" : [ {
                              "@type" : "C_INTEGER",
                              "rmTypeName" : "INTEGER",
                              "occurrences" : "1..1",
                              "constraint" : [ {
                                "lower" : 1,
                                "lowerIncluded" : true,
                                "upperIncluded" : false,
                                "lowerUnbounded" : false,
                                "upperUnbounded" : true
                              } ]
                            } ]
                          } ],
                          "attributeTuples" : [ ]
                        }, {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "DV_TEXT",
                          "attributes" : [ ],
                          "attributeTuples" : [ ]
                        } ]
                      } ],
                      "attributeTuples" : [ ]
                    }, {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "ELEMENT",
                      "nodeId" : "at0013.1",
                      "attributes" : [ ],
                      "attributeTuples" : [ ]
                    }, {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "ELEMENT",
                      "nodeId" : "at0082.1",
                      "attributes" : [ ],
                      "attributeTuples" : [ ]
                    }, {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "ELEMENT",
                      "occurrences" : "0..0",
                      "nodeId" : "at0030.1",
                      "attributes" : [ {
                        "@type" : "C_ATTRIBUTE",
                        "rmAttributeName" : "value",
                        "children" : [ {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "DV_CODED_TEXT",
                          "attributes" : [ {
                            "@type" : "C_ATTRIBUTE",
                            "rmAttributeName" : "defining_code",
                            "children" : [ {
                              "@type" : "C_TERMINOLOGY_CODE",
                              "rmTypeName" : "TERMINOLOGY_CODE",
                              "occurrences" : "1..1",
                              "terminologyId" : {
                                "value" : "local"
                              },
                              "constraint" : [ "ac0.2" ],
                              "selectedTerminologies" : [ ]
                            } ]
                          } ],
                          "attributeTuples" : [ ]
                        }, {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "DV_TEXT",
                          "attributes" : [ ],
                          "attributeTuples" : [ ]
                        } ]
                      } ],
                      "attributeTuples" : [ ]
                    }, {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "ELEMENT",
                      "occurrences" : "0..0",
                      "nodeId" : "at0065.1",
                      "attributes" : [ {
                        "@type" : "C_ATTRIBUTE",
                        "rmAttributeName" : "value",
                        "children" : [ {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "DV_QUANTITY",
                          "attributes" : [ {
                            "@type" : "C_ATTRIBUTE",
                            "rmAttributeName" : "property",
                            "children" : [ {
                              "@type" : "C_TERMINOLOGY_CODE",
                              "terminologyId" : {
                                "value" : "openehr"
                              },
                              "constraint" : [ "347" ]
                            } ]
                          } ],
                          "attributeTuples" : [ {
                            "@type" : "C_ATTRIBUTE_TUPLE",
                            "members" : [ {
                              "@type" : "C_ATTRIBUTE",
                              "rmAttributeName" : "units",
                              "children" : [ ]
                            }, {
                              "@type" : "C_ATTRIBUTE",
                              "rmAttributeName" : "magnitude",
                              "children" : [ ]
                            }, {
                              "@type" : "C_ATTRIBUTE",
                              "rmAttributeName" : "precision",
                              "children" : [ ]
                            } ],
                            "tuples" : [ {
                              "@type" : "C_PRIMITIVE_TUPLE",
                              "members" : [ {
                                "@type" : "C_STRING",
                                "rmTypeName" : "STRING",
                                "constraint" : [ "g/d" ]
                              }, {
                                "@type" : "C_REAL",
                                "rmTypeName" : "REAL",
                                "constraint" : [ {
                                  "lower" : 0.0,
                                  "lowerIncluded" : true,
                                  "upperIncluded" : false,
                                  "lowerUnbounded" : false,
                                  "upperUnbounded" : true
                                } ]
                              }, {
                                "@type" : "C_INTEGER",
                                "rmTypeName" : "INTEGER",
                                "constraint" : [ {
                                  "lower" : 1,
                                  "upper" : 1,
                                  "lowerIncluded" : true,
                                  "upperIncluded" : true,
                                  "lowerUnbounded" : false,
                                  "upperUnbounded" : false
                                } ]
                              } ]
                            }, {
                              "@type" : "C_PRIMITIVE_TUPLE",
                              "members" : [ {
                                "@type" : "C_STRING",
                                "rmTypeName" : "STRING",
                                "constraint" : [ "g/wk" ]
                              }, {
                                "@type" : "C_REAL",
                                "rmTypeName" : "REAL",
                                "constraint" : [ {
                                  "lower" : 0.0,
                                  "lowerIncluded" : true,
                                  "upperIncluded" : false,
                                  "lowerUnbounded" : false,
                                  "upperUnbounded" : true
                                } ]
                              }, {
                                "@type" : "C_INTEGER",
                                "rmTypeName" : "INTEGER",
                                "constraint" : [ {
                                  "lower" : 1,
                                  "upper" : 1,
                                  "lowerIncluded" : true,
                                  "upperIncluded" : true,
                                  "lowerUnbounded" : false,
                                  "upperUnbounded" : false
                                } ]
                              } ]
                            }, {
                              "@type" : "C_PRIMITIVE_TUPLE",
                              "members" : [ {
                                "@type" : "C_STRING",
                                "rmTypeName" : "STRING",
                                "constraint" : [ "[oz_av]/d" ]
                              }, {
                                "@type" : "C_REAL",
                                "rmTypeName" : "REAL",
                                "constraint" : [ {
                                  "lower" : 0.0,
                                  "lowerIncluded" : true,
                                  "upperIncluded" : false,
                                  "lowerUnbounded" : false,
                                  "upperUnbounded" : true
                                } ]
                              }, {
                                "@type" : "C_INTEGER",
                                "rmTypeName" : "INTEGER",
                                "constraint" : [ {
                                  "lower" : 1,
                                  "upper" : 1,
                                  "lowerIncluded" : true,
                                  "upperIncluded" : true,
                                  "lowerUnbounded" : false,
                                  "upperUnbounded" : false
                                } ]
                              } ]
                            }, {
                              "@type" : "C_PRIMITIVE_TUPLE",
                              "members" : [ {
                                "@type" : "C_STRING",
                                "rmTypeName" : "STRING",
                                "constraint" : [ "[oz_av]/wk" ]
                              }, {
                                "@type" : "C_REAL",
                                "rmTypeName" : "REAL",
                                "constraint" : [ {
                                  "lower" : 0.0,
                                  "lowerIncluded" : true,
                                  "upperIncluded" : false,
                                  "lowerUnbounded" : false,
                                  "upperUnbounded" : true
                                } ]
                              }, {
                                "@type" : "C_INTEGER",
                                "rmTypeName" : "INTEGER",
                                "constraint" : [ {
                                  "lower" : 1,
                                  "upper" : 1,
                                  "lowerIncluded" : true,
                                  "upperIncluded" : true,
                                  "lowerUnbounded" : false,
                                  "upperUnbounded" : false
                                } ]
                              } ]
                            } ]
                          } ]
                        } ]
                      } ],
                      "attributeTuples" : [ ]
                    }, {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "ELEMENT",
                      "occurrences" : "0..0",
                      "nodeId" : "at0025.1",
                      "attributes" : [ {
                        "@type" : "C_ATTRIBUTE",
                        "rmAttributeName" : "value",
                        "children" : [ {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "DV_COUNT",
                          "attributes" : [ {
                            "@type" : "C_ATTRIBUTE",
                            "rmAttributeName" : "magnitude",
                            "children" : [ {
                              "@type" : "C_INTEGER",
                              "rmTypeName" : "INTEGER",
                              "occurrences" : "1..1",
                              "constraint" : [ {
                                "lower" : 0,
                                "lowerIncluded" : true,
                                "upperIncluded" : false,
                                "lowerUnbounded" : false,
                                "upperUnbounded" : true
                              } ]
                            } ]
                          } ],
                          "attributeTuples" : [ ]
                        } ]
                      } ],
                      "attributeTuples" : [ ]
                    }, {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "ELEMENT",
                      "occurrences" : "0..0",
                      "nodeId" : "at0087.1",
                      "attributes" : [ ],
                      "attributeTuples" : [ ]
                    } ]
                  } ],
                  "attributeTuples" : [ ]
                }, {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "ELEMENT",
                  "occurrences" : "0..0",
                  "nodeId" : "at0014.1",
                  "attributes" : [ ],
                  "attributeTuples" : [ ]
                }, {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "ELEMENT",
                  "nodeId" : "at0017.1",
                  "attributes" : [ {
                    "@type" : "C_ATTRIBUTE",
                    "rmAttributeName" : "value",
                    "children" : [ {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "DV_COUNT",
                      "attributes" : [ {
                        "@type" : "C_ATTRIBUTE",
                        "rmAttributeName" : "magnitude",
                        "children" : [ {
                          "@type" : "C_INTEGER",
                          "rmTypeName" : "INTEGER",
                          "occurrences" : "1..1",
                          "constraint" : [ {
                            "lower" : 0,
                            "lowerIncluded" : true,
                            "upperIncluded" : false,
                            "lowerUnbounded" : false,
                            "upperUnbounded" : true
                          } ]
                        } ]
                      } ],
                      "attributeTuples" : [ ]
                    } ]
                  } ],
                  "attributeTuples" : [ ]
                }, {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "ELEMENT",
                  "occurrences" : "0..0",
                  "nodeId" : "at0069.1",
                  "attributes" : [ ],
                  "attributeTuples" : [ ]
                } ]
              } ],
              "attributeTuples" : [ ]
            }, {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "ELEMENT",
              "nodeId" : "at0093.1",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "value",
                "children" : [ {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "DV_QUANTITY",
                  "attributes" : [ {
                    "@type" : "C_ATTRIBUTE",
                    "rmAttributeName" : "property",
                    "children" : [ {
                      "@type" : "C_TERMINOLOGY_CODE",
                      "rmTypeName" : "TERMINOLOGY_CODE",
                      "occurrences" : "1..1",
                      "terminologyId" : {
                        "value" : "openehr"
                      },
                      "constraint" : [ "128" ]
                    } ]
                  } ],
                  "attributeTuples" : [ {
                    "@type" : "C_ATTRIBUTE_TUPLE",
                    "members" : [ {
                      "@type" : "C_ATTRIBUTE",
                      "rmAttributeName" : "units",
                      "children" : [ ]
                    }, {
                      "@type" : "C_ATTRIBUTE",
                      "rmAttributeName" : "magnitude",
                      "children" : [ ]
                    }, {
                      "@type" : "C_ATTRIBUTE",
                      "rmAttributeName" : "precision",
                      "children" : [ ]
                    } ],
                    "tuples" : [ {
                      "@type" : "C_PRIMITIVE_TUPLE",
                      "members" : [ {
                        "@type" : "C_STRING",
                        "rmTypeName" : "STRING",
                        "constraint" : [ "a" ]
                      }, {
                        "@type" : "C_REAL",
                        "rmTypeName" : "REAL",
                        "constraint" : [ {
                          "lower" : 0.0,
                          "lowerIncluded" : true,
                          "upperIncluded" : false,
                          "lowerUnbounded" : false,
                          "upperUnbounded" : true
                        } ]
                      }, {
                        "@type" : "C_INTEGER",
                        "rmTypeName" : "INTEGER",
                        "constraint" : [ {
                          "lower" : 2,
                          "upper" : 2,
                          "lowerIncluded" : true,
                          "upperIncluded" : true,
                          "lowerUnbounded" : false,
                          "upperUnbounded" : false
                        } ]
                      } ]
                    } ]
                  } ]
                } ]
              } ],
              "attributeTuples" : [ ]
            }, {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "ELEMENT",
              "occurrences" : "0..0",
              "nodeId" : "at0094.1",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "value",
                "children" : [ {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "DV_COUNT",
                  "attributes" : [ {
                    "@type" : "C_ATTRIBUTE",
                    "rmAttributeName" : "magnitude",
                    "children" : [ {
                      "@type" : "C_INTEGER",
                      "rmTypeName" : "INTEGER",
                      "occurrences" : "1..1",
                      "constraint" : [ {
                        "lower" : 0,
                        "lowerIncluded" : true,
                        "upperIncluded" : false,
                        "lowerUnbounded" : false,
                        "upperUnbounded" : true
                      } ]
                    } ]
                  } ],
                  "attributeTuples" : [ ]
                } ]
              } ],
              "attributeTuples" : [ ]
            }, {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "ELEMENT",
              "occurrences" : "0..0",
              "nodeId" : "at0074.1",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "value",
                "children" : [ {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "DV_COUNT",
                  "attributes" : [ {
                    "@type" : "C_ATTRIBUTE",
                    "rmAttributeName" : "magnitude",
                    "children" : [ {
                      "@type" : "C_INTEGER",
                      "rmTypeName" : "INTEGER",
                      "occurrences" : "1..1",
                      "constraint" : [ {
                        "lower" : 0,
                        "lowerIncluded" : true,
                        "upperIncluded" : false,
                        "lowerUnbounded" : false,
                        "upperUnbounded" : true
                      } ]
                    } ]
                  } ],
                  "attributeTuples" : [ ]
                } ]
              } ],
              "attributeTuples" : [ ]
            }, {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "ELEMENT",
              "occurrences" : "0..0",
              "nodeId" : "at0019.1",
              "attributes" : [ ],
              "attributeTuples" : [ ]
            } ]
          } ],
          "attributeTuples" : [ ]
        } ]
      }, {
        "@type" : "C_ATTRIBUTE",
        "rmAttributeName" : "protocol",
        "children" : [ {
          "@type" : "C_COMPLEX_OBJECT",
          "rmTypeName" : "ITEM_TREE",
          "nodeId" : "at0021",
          "attributes" : [ {
            "@type" : "C_ATTRIBUTE",
            "rmAttributeName" : "items",
            "children" : [ {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "ELEMENT",
              "occurrences" : "0..0",
              "nodeId" : "at0071.1",
              "attributes" : [ ],
              "attributeTuples" : [ ]
            }, {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "ELEMENT",
              "occurrences" : "0..0",
              "nodeId" : "at0085.1",
              "attributes" : [ ],
              "attributeTuples" : [ ]
            }, {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "ELEMENT",
              "occurrences" : "0..0",
              "nodeId" : "at0075.1",
              "attributes" : [ ],
              "attributeTuples" : [ ]
            }, {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "ELEMENT",
              "occurrences" : "0..0",
              "nodeId" : "at0076.1",
              "attributes" : [ ],
              "attributeTuples" : [ ]
            }, {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "ELEMENT",
              "occurrences" : "0..0",
              "nodeId" : "at0079.1",
              "attributes" : [ ],
              "attributeTuples" : [ ]
            }, {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "ELEMENT",
              "occurrences" : "0..0",
              "nodeId" : "at0072.1",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "value",
                "children" : [ {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "DV_COUNT",
                  "attributes" : [ {
                    "@type" : "C_ATTRIBUTE",
                    "rmAttributeName" : "magnitude",
                    "children" : [ {
                      "@type" : "C_INTEGER",
                      "rmTypeName" : "INTEGER",
                      "occurrences" : "1..1",
                      "constraint" : [ {
                        "lower" : 0,
                        "lowerIncluded" : true,
                        "upperIncluded" : false,
                        "lowerUnbounded" : false,
                        "upperUnbounded" : true
                      } ]
                    } ]
                  } ],
                  "attributeTuples" : [ ]
                }, {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "DV_QUANTITY",
                  "attributes" : [ {
                    "@type" : "C_ATTRIBUTE",
                    "rmAttributeName" : "property",
                    "children" : [ {
                      "@type" : "C_TERMINOLOGY_CODE",
                      "occurrences" : "0..1",
                      "terminologyId" : {
                        "value" : "openehr"
                      },
                      "constraint" : [ "124" ]
                    } ]
                  } ],
                  "attributeTuples" : [ {
                    "@type" : "C_ATTRIBUTE_TUPLE",
                    "members" : [ {
                      "@type" : "C_ATTRIBUTE",
                      "rmAttributeName" : "units",
                      "children" : [ ]
                    }, {
                      "@type" : "C_ATTRIBUTE",
                      "rmAttributeName" : "magnitude",
                      "children" : [ ]
                    }, {
                      "@type" : "C_ATTRIBUTE",
                      "rmAttributeName" : "precision",
                      "children" : [ ]
                    } ],
                    "tuples" : [ {
                      "@type" : "C_PRIMITIVE_TUPLE",
                      "members" : [ {
                        "@type" : "C_STRING",
                        "rmTypeName" : "STRING",
                        "constraint" : [ "g" ]
                      }, {
                        "@type" : "C_REAL",
                        "rmTypeName" : "REAL",
                        "constraint" : [ {
                          "lower" : 0.0,
                          "lowerIncluded" : true,
                          "upperIncluded" : false,
                          "lowerUnbounded" : false,
                          "upperUnbounded" : true
                        } ]
                      }, {
                        "@type" : "C_INTEGER",
                        "rmTypeName" : "INTEGER",
                        "constraint" : [ {
                          "lower" : 0,
                          "upper" : 0,
                          "lowerIncluded" : true,
                          "upperIncluded" : true,
                          "lowerUnbounded" : false,
                          "upperUnbounded" : false
                        } ]
                      } ]
                    }, {
                      "@type" : "C_PRIMITIVE_TUPLE",
                      "members" : [ {
                        "@type" : "C_STRING",
                        "rmTypeName" : "STRING",
                        "constraint" : [ "[oz_av]" ]
                      }, {
                        "@type" : "C_REAL",
                        "rmTypeName" : "REAL",
                        "constraint" : [ {
                          "lower" : 0.0,
                          "lowerIncluded" : true,
                          "upperIncluded" : false,
                          "lowerUnbounded" : false,
                          "upperUnbounded" : true
                        } ]
                      }, {
                        "@type" : "C_INTEGER",
                        "rmTypeName" : "INTEGER",
                        "constraint" : [ {
                          "lower" : 0,
                          "upper" : 0,
                          "lowerIncluded" : true,
                          "upperIncluded" : true,
                          "lowerUnbounded" : false,
                          "upperUnbounded" : false
                        } ]
                      } ]
                    } ]
                  } ]
                } ]
              } ],
              "attributeTuples" : [ ]
            }, {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "ELEMENT",
              "occurrences" : "0..0",
              "nodeId" : "at0022.1",
              "attributes" : [ ],
              "attributeTuples" : [ ]
            } ]
          } ],
          "attributeTuples" : [ ]
        } ]
      } ],
      "attributeTuples" : [ ]
    },
    "terminology" : {
      "@type" : "ARCHETYPE_TERMINOLOGY",
      "conceptCode" : "at0000",
      "termDefinitions" : {
        "en" : {
          "ac0.1" : {
            "@type" : "ARCHETYPE_TERM",
            "text" : "(Synthesized)",
            "code" : "ac0.1",
            "description" : ""
          },
          "ac0.2" : {
            "@type" : "ARCHETYPE_TERM",
            "text" : "(Synthesized)",
            "code" : "ac0.2",
            "description" : ""
          },
          "at0080.1" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0080.1",
            "text" : "Overall smoking commenced",
            "description" : "The date or partial date when the individual first started daily smoking of tobacco of any type.",
            "comment" : "Can be a partial date, for example, only a year."
          },
          "at0017.1" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0017.1",
            "text" : "Number of years smoking",
            "description" : "Estimate of the cumulative amount of tobacco smoked using the specified type of tobacco.",
            "comment" : "Commonly used in assessment of cigarette use. It is calculated by multiplying the number of packs of cigarettes smoked per day by the number of years the individual has smoked. One pack year equals 365 packs of cigarettes. Details about how to calculate pack years for other types of tobacco can be found at http://smokingpackyears.com. The definition of a pack can be recorded in the protocol of this archetype using the 'Pack definition' data element."
          }
        },
        "nb" : {
          "ac0.1" : {
            "@type" : "ARCHETYPE_TERM",
            "text" : "*(Synthesized) (en)",
            "code" : "ac0.1",
            "description" : ""
          },
          "ac0.2" : {
            "@type" : "ARCHETYPE_TERM",
            "text" : "*(Synthesized) (en)",
            "code" : "ac0.2",
            "description" : ""
          }
        },
        "sv" : {
          "ac0.1" : {
            "@type" : "ARCHETYPE_TERM",
            "text" : "*(Synthesized) (en)",
            "code" : "ac0.1",
            "description" : ""
          },
          "ac0.2" : {
            "@type" : "ARCHETYPE_TERM",
            "text" : "*(Synthesized) (en)",
            "code" : "ac0.2",
            "description" : ""
          }
        },
        "de" : {
          "ac0.1" : {
            "@type" : "ARCHETYPE_TERM",
            "text" : "*(Synthesized) (en)",
            "code" : "ac0.1",
            "description" : ""
          },
          "ac0.2" : {
            "@type" : "ARCHETYPE_TERM",
            "text" : "*(Synthesized) (en)",
            "code" : "ac0.2",
            "description" : ""
          }
        },
        "fr" : {
          "ac0.1" : {
            "@type" : "ARCHETYPE_TERM",
            "text" : "*(Synthesized) (en)",
            "code" : "ac0.1",
            "description" : ""
          },
          "ac0.2" : {
            "@type" : "ARCHETYPE_TERM",
            "text" : "*(Synthesized) (en)",
            "code" : "ac0.2",
            "description" : ""
          }
        },
        "nl" : {
          "ac0.1" : {
            "@type" : "ARCHETYPE_TERM",
            "text" : "*(Synthesized) (en)",
            "code" : "ac0.1",
            "description" : ""
          },
          "ac0.2" : {
            "@type" : "ARCHETYPE_TERM",
            "text" : "*(Synthesized) (en)",
            "code" : "ac0.2",
            "description" : ""
          }
        }
      },
      "termBindings" : { },
      "terminologyExtracts" : { },
      "valueSets" : {
        "ac0.1" : {
          "@type" : "VALUE_SET",
          "id" : "ac0.1",
          "members" : [ "at0061", "at0059", "at0091" ]
        },
        "ac0.2" : {
          "@type" : "VALUE_SET",
          "id" : "ac0.2",
          "members" : [ "at0083", "at0084" ]
        },
        "ac0.4" : {
          "@type" : "VALUE_SET",
          "id" : "ac0.4",
          "members" : [ "at0054", "at0055", "at0056", "at0066", "at0057", "at0062", "at0078", "at0088" ]
        },
        "ac0.5" : {
          "@type" : "VALUE_SET",
          "id" : "ac0.5",
          "members" : [ ]
        },
        "ac0.6" : {
          "@type" : "VALUE_SET",
          "id" : "ac0.6",
          "members" : [ ]
        },
        "ac0.8" : {
          "@type" : "VALUE_SET",
          "id" : "ac0.8",
          "members" : [ "at0054", "at0055", "at0056", "at0066", "at0057", "at0062", "at0078", "at0088" ]
        },
        "ac0.9" : {
          "@type" : "VALUE_SET",
          "id" : "ac0.9",
          "members" : [ ]
        },
        "ac0.10" : {
          "@type" : "VALUE_SET",
          "id" : "ac0.10",
          "members" : [ ]
        }
      }
    },
    "adlVersion" : "1.4",
    "buildUid" : "6730845d-bc61-4917-8ed9-34b1248b7b1e",
    "rmName" : "openehr",
    "rmRelease" : "1.1.0",
    "generated" : true,
    "otherMetaData" : { },
    "originalLanguage" : {
      "terminologyId" : {
        "value" : "ISO_639-1"
      },
      "codeString" : "en"
    },
    "translations" : [ {
      "@type" : "TRANSLATION_DETAILS",
      "language" : {
        "terminologyId" : {
          "value" : "ISO_639-1"
        },
        "codeString" : "de"
      },
      "author" : {
        "name" : "Caroline Thoms, Eva-Maria Rieß, Natalia Strauch",
        "organisation" : "UMG, Universitätsmedizin Göttingen, Medizinische Hochschule Hannover",
        "email" : "Caroline.Thoms@med.uni-goettingen.de, eva-maria.riess@med.uni-goettingen.de, Strauch.Natalia@mh-hannover.de"
      },
      "otherDetails" : { }
    }, {
      "@type" : "TRANSLATION_DETAILS",
      "language" : {
        "terminologyId" : {
          "value" : "ISO_639-1"
        },
        "codeString" : "sv"
      },
      "author" : {
        "name" : "Erik Sundvall",
        "organisation" : "Region Östergötland + Linköping University",
        "email" : "erik.sundvall@regionostergotland.se"
      },
      "otherDetails" : { }
    }, {
      "@type" : "TRANSLATION_DETAILS",
      "language" : {
        "terminologyId" : {
          "value" : "ISO_639-1"
        },
        "codeString" : "nb"
      },
      "author" : {
        "name" : "John Tore Valand",
        "organisation" : "Helse Bergen HF"
      },
      "otherDetails" : { }
    }, {
      "@type" : "TRANSLATION_DETAILS",
      "language" : {
        "terminologyId" : {
          "value" : "ISO_639-1"
        },
        "codeString" : "fr"
      },
      "author" : {
        "name" : "Bassem Khouzam, Vanessa Pereira",
        "organisation" : "Medtronic, Better - Pathfinder",
        "email" : "bassem.khouzam@medtronic.com, vanessapereira@protonmail.com"
      },
      "otherDetails" : { }
    }, {
      "@type" : "TRANSLATION_DETAILS",
      "language" : {
        "terminologyId" : {
          "value" : "ISO_639-1"
        },
        "codeString" : "nl"
      },
      "author" : {
        "name" : "Martijn van Eenennaam",
        "organisation" : "Nedap",
        "email" : "martijn.vaneenennaam@nedap.com"
      },
      "accreditation" : "Ph.D.",
      "otherDetails" : { }
    } ]
  }, {
    "@type" : "TEMPLATE_OVERLAY",
    "uid" : "09695dbb-b62f-4ba1-9acb-9458f5bb05db",
    "description" : {
      "@type" : "RESOURCE_DESCRIPTION",
      "originalAuthor" : { },
      "otherContributors" : [ ],
      "ipAcknowledgements" : { },
      "references" : { },
      "conversionDetails" : { },
      "otherDetails" : {
        "PARENT:MD5-CAM-1.0.1" : "60834FB342B68A169ADF87DE620BC29D"
      },
      "details" : {
        "de" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "de"
          },
          "purpose" : "*To create a framework for recording answers to pre-defined screening questions about the use of any specified substance or a grouping of substances. (en)",
          "keywords" : [ "*substance, screening, questionnaire, drug (en)" ],
          "use" : "*Use to create a framework for recording answers to pre-defined screening questions about the use of any specified substance or a grouping of substances.\r\n\r\nCommon use cases include, but are not limited to:\r\n- Systematic questioning in any consultation, for example:\r\n--- Do you smoke? Yes, No, Unknown\r\n--- For how long have you been smoking?\r\n--- Do you use any illegal substances? Yes, No, Unknown.\r\n--- Have you been drinking alcohol the last four weeks? Yes, No, Unknown.\r\n- Specific questioning related to substance use.\r\n\r\n\t\r\nUse to create a framework for recording answers to pre-defined screening questions about the use of any specified medication or grouping (including classes) of medications.\r\n\r\nExamples of medications, groupings and classes of medications are 'alendronic acid', 'anti osteoporosis medications' and 'bisphosphonates', respectively.\r\n\r\nCommon use cases include, but are not limited to:\r\n- Systematic questioning in any consultation related to patterns of medication usage, for example:\r\n--- Do you use paracetamol? Yes, No, Unknown.\r\n--- Have you been using any anticoagulants the last four weeks? Yes, No, Unknown.\r\n\r\nThe semantics of this archetype are intentionally loose, and querying this archetype would normally only be useful or safe within the context of each specific template. In a template, each data element would usually be renamed to the specific question asked. Where value sets have been proposed for common use cases, these can be adapted for local use by using the DV_TEXT or the DV_BOOLEAN datatypes choice to match each specific use case.\r\n\r\nThe EVENT structure from the reference model can be used to specify whether the questions relate to point in time or over a period of time. Use a separate instance of this archetype to distinguish between a questionnaire recording information about a medication that has been used at any time in the past and information about a medication used within a specified time interval - for example the difference between \"Do you drink alcohol?\" compared to \"Have you been drinking any alcohol during the last four weeks?\". \r\n\r\nThe source of the information in a questionnaire response may vary in different contexts but can be specifically identified using the 'Information provider' element in the Reference Model.\r\n\r\nThis archetype has been designed to be used as a screening tool or to record simple questionnaire-format data for use in situations such as a disease registry. If the screening questionnaire identifies the presence of a substance it is recommended that clinical system record and persist the specific details about the substance using a relevant archetype, for example the EVALUATION.tobacco_smoking_summary or the EVALUATION.substance_use_summary. (en)",
          "misuse" : "*Not to be used for recording a summary of use of a substance over the lifetime of the individual - use EVALUATION.substance_use_summary for this purpose.\r\n\r\nNot to be used for recording a summary of use of tobacco over the lifetime of the individual - use EVALUATION.smokeless_tobacco_summary or EVALUATION.tobacco_smoking_summary for this purpose.\r\n\r\nNot to be used for recording a summary of use of alcohol over the lifetime of the individual - use EVALUATION.alcohol_consumption_summary for this purpose.\r\n\r\nNot to be used for recording information about the use of a medication. Use a relevant medication archetype for this purpose.\r\n\r\nNot to be used to record details about a simple selection list where a question may be recorded as either \"present\" or \"indeterminate\". Use OBSERVATION.selection_list for this purpose. (en)",
          "copyright" : "© openEHR Foundation, Nasjonal IKT HF, openEHR Foundation, openEHR Foundation",
          "originalResourceUri" : { },
          "otherDetails" : { }
        },
        "nb" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "nb"
          },
          "purpose" : "For å lage et rammeverk for registrering av svar på forhåndsdefinerte spørsmål om skadelig eller farlig bruk av legemidler og andre lovlige og ulovlige stoffer.",
          "keywords" : [ "intervjuskjema, kartleggingskjema, spørreskjema, dop" ],
          "use" : "Brukes for å lage et rammeverk for registrering av svar på forhåndsdefinerte spørsmål om skadelig eller farlig bruk av legemidler og andre lovlige og ulovlige stoffer.\r\n\r\nVanlige bruksområder inkluderer, men er ikke begrenset til:\r\n- Systematiske spørsmål ved konsultasjoner, for eksempel:\r\n--- Røyker du? Ja, Nei, Usikker.\r\n--- Hvor lenge har du røyket?\r\n--- Har du noen sinne injisert rusmidler? Ja, Nei, Usikker.\r\n--- Bruker du prestasjonsfremmende substanser? Ja, Nei, Usikker.\r\n--- Har du drukket alkohol de siste fire ukene? Ja, Nei, Usikker.\r\n- Spørsmål relatert til bruken av spesifikke substanser.\r\n\r\nSemantikken til denne arketypen er med vilje løst definert, og spørringer etter data i denne arketypen vil normalt bare være hensiktsmessig eller sikkert i konteksten av det spesifikke templatet. I et templat vil hvert dataelement vanligvis døpes om til det (spesifikke) spørsmålet man ønsker svar på. Flere steder er det foreslått verdisett som passer til de vanligste bruksområder, men det er allikevel mulig å tilpasse/endre verdisett for lokal bruk ved å benytte de alternative datatypene DV_TEXT eller DV_BOOLEAN for å harmonere verdisettet til hvert enkelt brukstilfelle.\r\n\r\nEVENT-strukturen fra arketypens referansemodell kan brukes for å spesifisere om spørsmålene relateres til et tidspunkt eller til et tidsintervall.\r\nBruk egne instanser av denne arketypen for å skille mellom spørsmål om prosedyrer som er gjennomførte på et hvilket som helst tidspunkt og spørsmål om prosedyrer som er gjennomført i et tidsintervall. For eksempel; \"Bruker du rusmidler?\" sammenlignet med \"Har du brukt rusmidler de siste fire ukene?\".\r\n\r\nKilden til informasjonen i et spørreskjema kan variere i ulike kontekster, men kan identifiseres spesifikt ved å benytte \"Information provider\" elementet i openEHR referansemodellen.\r\n\r\nDenne arketypen er laget for å bli brukt i et spørreskjema eller for å registrere enkle strukturerte data til for eksempel et sykdomsregister. Dersom det i spørreskjemaet identifiseres at bruken av en substans er tilstede, anbefales det at spesifikke detaljer om substansen registreres og lagres i pasientjournalen i en relevant arketype, for eksempel i arketypene EVALUATION.tobacco_smoking_summary eller EVALUATION.substance_use_summary.",
          "misuse" : "Brukes ikke for å registrere et sammendrag av bruken av en substans over et individs livstid, bruk arketypen EVALUATION.substance_use_summary for dette formålet.\r\n\r\nBrukes ikke for å registrere et sammendrag av bruken av tobakk over et individs livstid, bruk arketypen EVALUATION.smokeless_tobacco_summary eller EVALUATION.tobacco_smoking_summary for dette formålet.\r\n\r\nBrukes ikke for å registrere et sammendrag av bruken av tobakk over et individs livstid, bruk arketypen EVALUATION.alcohol_consumption_summary for dette formålet.\r\n\r\nBrukes ikke for å registrere hendelses- eller periodebasert informasjon om bruken av en substans utenfor konteksten av kartleggingen. Bruke en relevant OBSERVATION-arketype for dette formålet.",
          "copyright" : "© openEHR Foundation, Nasjonal IKT HF, openEHR Foundation, openEHR Foundation",
          "originalResourceUri" : { },
          "otherDetails" : { }
        },
        "en" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "en"
          },
          "purpose" : "To create a framework for recording answers to pre-defined screening questions about the harmful or hazardous use of medications, and other legal and illegal substances.\r\n",
          "keywords" : [ "substance, screening, questionnaire, drug" ],
          "use" : "Use to create a framework for recording answers to pre-defined screening questions about the use of any specified substance or a grouping of substances without a prescription or beyond its intended scope or expected use.\r\n\r\nCommon use cases include, but are not limited to:\r\n- Systematic questioning in any consultation, for example:\r\n--- Do you smoke? Yes, No, Unknown\r\n--- For how long have you been smoking?\r\n--- Have you ever injected drugs? Yes, No, Unknown.\r\n--- Do you use performance enhancing substances? Yes, No, Unknown.\r\n--- Have you been drinking alcohol the last four weeks? Yes, No, Unknown.\r\n- Questions related to use of specific substances.\t\r\n\r\nThe semantics of this archetype are intentionally loose, and querying this archetype would normally only be useful or safe within the context of each specific template. In a template, each data element would usually be renamed to the specific question asked. Where value sets have been proposed for common use cases, these can be adapted for local use by using the DV_TEXT or the DV_BOOLEAN datatypes choice to match each specific use case.\r\n\r\nThe EVENT structure from the reference model can be used to specify whether the questions relate to point in time or over a period of time. Use a separate instance of this archetype to distinguish between a questionnaire recording information about a medication that has been used at any time in the past and information about a medication used within a specified time interval - for example the difference between \"Do you drink alcohol?\" compared to \"Have you been drinking any alcohol during the last four weeks?\". \r\n\r\nThe source of the information in a questionnaire response may vary in different contexts but can be specifically identified using the 'Information provider' element in the Reference Model.\r\n\r\nThis archetype has been designed to be used as a screening tool or to record simple questionnaire-format data for use in situations such as a disease registry. If the screening questionnaire identifies the presence of a substance it is recommended that clinical system record and persist the specific details about the substance using a relevant archetype, for example the EVALUATION.tobacco_smoking_summary or the EVALUATION.substance_use_summary archetypes.",
          "misuse" : "Not to be used for recording a summary of use of a substance over the lifetime of the individual - use EVALUATION.substance_use_summary for this purpose.\r\n\r\nNot to be used for recording a summary of use of tobacco over the lifetime of the individual - use EVALUATION.smokeless_tobacco_summary or EVALUATION.tobacco_smoking_summary for this purpose.\r\n\r\nNot to be used for recording a summary of use of alcohol over the lifetime of the individual - use EVALUATION.alcohol_consumption_summary for this purpose.\r\n\r\nNot to be used to record event-or period-based information about the use of a substance, outside of a screening context - use a relevant OBSERVATION.archetype for this purpose.\r\n\r\nNot to be used for recording information about the use of a medication, putside of a screening context. Use a relevant medication archetype for this purpose.",
          "copyright" : "© openEHR Foundation, Nasjonal IKT HF",
          "originalResourceUri" : { },
          "otherDetails" : { }
        },
        "nl" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "nl"
          },
          "purpose" : "*To create a framework for recording answers to pre-defined screening questions about the use of any specified substance or a grouping of substances. (en)",
          "keywords" : [ "*substance, screening, questionnaire, drug (en)" ],
          "use" : "*Use to create a framework for recording answers to pre-defined screening questions about the use of any specified substance or a grouping of substances.\r\n\r\nCommon use cases include, but are not limited to:\r\n- Systematic questioning in any consultation, for example:\r\n--- Do you smoke? Yes, No, Unknown\r\n--- For how long have you been smoking?\r\n--- Do you use any illegal substances? Yes, No, Unknown.\r\n--- Have you been drinking alcohol the last four weeks? Yes, No, Unknown.\r\n- Specific questioning related to substance use.\r\n\r\n\t\r\nUse to create a framework for recording answers to pre-defined screening questions about the use of any specified medication or grouping (including classes) of medications.\r\n\r\nExamples of medications, groupings and classes of medications are 'alendronic acid', 'anti osteoporosis medications' and 'bisphosphonates', respectively.\r\n\r\nCommon use cases include, but are not limited to:\r\n- Systematic questioning in any consultation related to patterns of medication usage, for example:\r\n--- Do you use paracetamol? Yes, No, Unknown.\r\n--- Have you been using any anticoagulants the last four weeks? Yes, No, Unknown.\r\n\r\nThe semantics of this archetype are intentionally loose, and querying this archetype would normally only be useful or safe within the context of each specific template. In a template, each data element would usually be renamed to the specific question asked. Where value sets have been proposed for common use cases, these can be adapted for local use by using the DV_TEXT or the DV_BOOLEAN datatypes choice to match each specific use case.\r\n\r\nThe EVENT structure from the reference model can be used to specify whether the questions relate to point in time or over a period of time. Use a separate instance of this archetype to distinguish between a questionnaire recording information about a medication that has been used at any time in the past and information about a medication used within a specified time interval - for example the difference between \"Do you drink alcohol?\" compared to \"Have you been drinking any alcohol during the last four weeks?\". \r\n\r\nThe source of the information in a questionnaire response may vary in different contexts but can be specifically identified using the 'Information provider' element in the Reference Model.\r\n\r\nThis archetype has been designed to be used as a screening tool or to record simple questionnaire-format data for use in situations such as a disease registry. If the screening questionnaire identifies the presence of a substance it is recommended that clinical system record and persist the specific details about the substance using a relevant archetype, for example the EVALUATION.tobacco_smoking_summary or the EVALUATION.substance_use_summary. (en)",
          "misuse" : "*Not to be used for recording a summary of use of a substance over the lifetime of the individual - use EVALUATION.substance_use_summary for this purpose.\r\n\r\nNot to be used for recording a summary of use of tobacco over the lifetime of the individual - use EVALUATION.smokeless_tobacco_summary or EVALUATION.tobacco_smoking_summary for this purpose.\r\n\r\nNot to be used for recording a summary of use of alcohol over the lifetime of the individual - use EVALUATION.alcohol_consumption_summary for this purpose.\r\n\r\nNot to be used for recording information about the use of a medication. Use a relevant medication archetype for this purpose.\r\n\r\nNot to be used to record details about a simple selection list where a question may be recorded as either \"present\" or \"indeterminate\". Use OBSERVATION.selection_list for this purpose. (en)",
          "copyright" : "© openEHR Foundation, Nasjonal IKT HF, openEHR Foundation, openEHR Foundation",
          "originalResourceUri" : { },
          "otherDetails" : { }
        }
      }
    },
    "annotations" : {
      "@type" : "RESOURCE_ANNOTATIONS",
      "documentation" : {
        "en" : {
          "/data[at0022]/events[at0023]/data[at0001]/items[at0027.1]" : {
            "redcap_mapping" : "other_suyn"
          },
          "/data[at0022]/events[at0023]/data[at0001]/items[at0026.1]/items[at0024.1]" : {
            "redcap_mapping" : "other_sucat"
          },
          "/data[at0022]/events[at0023]/data[at0001]/items[at0026]/items[at0024.2]" : {
            "redcap_mapping" : "regular_caff eine_suyn___2"
          },
          "/data[at0022]/events[at0023]/data[at0001]/items[at0026]/items[at0024.3]" : {
            "redcap_mapping" : "regular_caff eine_suyn___3"
          },
          "/data[at0022]/events[at0023]/data[at0001]/items[at0026]/items[at0024.4]" : {
            "redcap_mapping" : "regular_caff eine_suyn___4"
          },
          "/data[at0022]/events[at0023]/data[at0001]/items[at0026.1]/items[at0002.1]" : {
            "redcap_mapping" : "other_sustdat"
          },
          "/data[at0022]/events[at0023]/data[at0001]/items[at0026.1]/items[at0021.1]" : {
            "redcap_mapping" : "other_sucat"
          },
          "/data[at0022]/events[at0023]/data[at0001]/items[at0027.2]" : {
            "redcap_mapping" : "su_cmyn"
          }
        }
      }
    },
    "parentArchetypeId" : "openEHR-EHR-OBSERVATION.substance_use_screening.v0",
    "differential" : true,
    "archetypeId" : {
      "@type" : "ARCHETYPE_HRID",
      "value" : "openEHR-EHR-OBSERVATION.ovl-substance_use_screening-003.v0"
    },
    "definition" : {
      "@type" : "C_COMPLEX_OBJECT",
      "rmTypeName" : "OBSERVATION",
      "nodeId" : "at0000.1",
      "attributes" : [ {
        "@type" : "C_ATTRIBUTE",
        "rmAttributeName" : "data",
        "children" : [ {
          "@type" : "C_COMPLEX_OBJECT",
          "rmTypeName" : "HISTORY",
          "nodeId" : "at0022",
          "attributes" : [ {
            "@type" : "C_ATTRIBUTE",
            "rmAttributeName" : "events",
            "children" : [ {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "EVENT",
              "nodeId" : "at0023",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "data",
                "children" : [ {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "ITEM_TREE",
                  "nodeId" : "at0001",
                  "attributes" : [ {
                    "@type" : "C_ATTRIBUTE",
                    "rmAttributeName" : "items",
                    "children" : [ {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "ELEMENT",
                      "occurrences" : "0..0",
                      "nodeId" : "at0040.1",
                      "attributes" : [ {
                        "@type" : "C_ATTRIBUTE",
                        "rmAttributeName" : "value",
                        "children" : [ {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "DV_TEXT",
                          "attributes" : [ {
                            "@type" : "C_ATTRIBUTE",
                            "rmAttributeName" : "value",
                            "children" : [ {
                              "@type" : "C_STRING",
                              "rmTypeName" : "STRING",
                              "constraint" : [ "Substance abuse screening for IBD" ]
                            } ]
                          } ],
                          "attributeTuples" : [ ]
                        } ]
                      } ],
                      "attributeTuples" : [ ]
                    }, {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "ELEMENT",
                      "nodeId" : "at0027.1",
                      "attributes" : [ {
                        "@type" : "C_ATTRIBUTE",
                        "rmAttributeName" : "value",
                        "children" : [ {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "DV_CODED_TEXT",
                          "attributes" : [ {
                            "@type" : "C_ATTRIBUTE",
                            "rmAttributeName" : "defining_code",
                            "children" : [ {
                              "@type" : "C_TERMINOLOGY_CODE",
                              "rmTypeName" : "TERMINOLOGY_CODE",
                              "occurrences" : "1..1",
                              "terminologyId" : {
                                "value" : "local"
                              },
                              "constraint" : [ "ac0.4" ],
                              "selectedTerminologies" : [ ]
                            } ]
                          } ],
                          "attributeTuples" : [ ]
                        } ]
                      } ],
                      "attributeTuples" : [ ]
                    }, {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "ELEMENT",
                      "nodeId" : "at0027.2",
                      "attributes" : [ {
                        "@type" : "C_ATTRIBUTE",
                        "rmAttributeName" : "value",
                        "children" : [ {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "DV_CODED_TEXT",
                          "attributes" : [ {
                            "@type" : "C_ATTRIBUTE",
                            "rmAttributeName" : "defining_code",
                            "children" : [ {
                              "@type" : "C_TERMINOLOGY_CODE",
                              "rmTypeName" : "TERMINOLOGY_CODE",
                              "occurrences" : "1..1",
                              "terminologyId" : {
                                "value" : "local"
                              },
                              "constraint" : [ "ac0.6" ],
                              "selectedTerminologies" : [ ]
                            } ]
                          } ],
                          "attributeTuples" : [ ]
                        } ]
                      } ],
                      "attributeTuples" : [ ]
                    }, {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "ELEMENT",
                      "occurrences" : "0..0",
                      "nodeId" : "at0042.1",
                      "attributes" : [ ],
                      "attributeTuples" : [ ]
                    }, {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "CLUSTER",
                      "nodeId" : "at0026.1",
                      "attributes" : [ {
                        "@type" : "C_ATTRIBUTE",
                        "rmAttributeName" : "items",
                        "children" : [ {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "ELEMENT",
                          "nodeId" : "at0021.1",
                          "attributes" : [ {
                            "@type" : "C_ATTRIBUTE",
                            "rmAttributeName" : "value",
                            "children" : [ {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_TEXT",
                              "defaultValue" : {
                                "value" : "Other substances abuse",
                                "@type" : "DV_TEXT"
                              },
                              "attributes" : [ {
                                "@type" : "C_ATTRIBUTE",
                                "rmAttributeName" : "value",
                                "children" : [ {
                                  "@type" : "C_STRING",
                                  "rmTypeName" : "STRING",
                                  "constraint" : [ "Other substances abuse" ]
                                } ]
                              } ],
                              "attributeTuples" : [ ]
                            } ]
                          } ],
                          "attributeTuples" : [ ]
                        }, {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "ELEMENT",
                          "nodeId" : "at0024.1",
                          "attributes" : [ {
                            "@type" : "C_ATTRIBUTE",
                            "rmAttributeName" : "value",
                            "children" : [ {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_TEXT",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            } ]
                          } ],
                          "attributeTuples" : [ ]
                        }, {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "ELEMENT",
                          "occurrences" : "0..0",
                          "nodeId" : "at0003.1",
                          "attributes" : [ {
                            "@type" : "C_ATTRIBUTE",
                            "rmAttributeName" : "value",
                            "children" : [ {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_DATE_TIME",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            }, {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_TEXT",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            } ]
                          } ],
                          "attributeTuples" : [ ]
                        }, {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "ELEMENT",
                          "nodeId" : "at0002.1",
                          "attributes" : [ {
                            "@type" : "C_ATTRIBUTE",
                            "rmAttributeName" : "value",
                            "children" : [ {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_DATE_TIME",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            } ]
                          } ],
                          "attributeTuples" : [ ]
                        }, {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "ELEMENT",
                          "occurrences" : "0..0",
                          "nodeId" : "at0025.1",
                          "attributes" : [ ],
                          "attributeTuples" : [ ]
                        } ]
                      } ],
                      "attributeTuples" : [ ]
                    } ]
                  } ],
                  "attributeTuples" : [ ]
                } ]
              } ],
              "attributeTuples" : [ ]
            } ]
          } ],
          "attributeTuples" : [ ]
        } ]
      } ],
      "attributeTuples" : [ ]
    },
    "terminology" : {
      "@type" : "ARCHETYPE_TERMINOLOGY",
      "conceptCode" : "at0000",
      "termDefinitions" : {
        "en" : {
          "at0000.1" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0000.1",
            "text" : "Substance use screening - other than smoking and alcohol",
            "description" : "Series of questions and associated answers used to screen for the harmful or hazardous use of medications, and other legal and illegal substances.",
            "comment" : "Also known as substance abuse, and includes substance dependence, addiction and doping. Examples of substances include, but are not limited to, alcohol, tobacco, amphetamines, barbiturates, benzodiazepines, cannabis, cocaine, hallucinogens, opioids, anabolic steroids, erythropoietin, or sniffing glue."
          },
          "at0027.1" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0027.1",
            "text" : "Substance abuse history other than smoking and alcohol?",
            "description" : "Is there a history of use of any substance related to the screening purpose?",
            "comment" : "In a template, the data element would usually be renamed to the specific question asked. The proposed value set can be adapted for local use by using the DV_TEXT or the DV_BOOLEAN datatypes choice to match each specific use case."
          },
          "at0024.1" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0024.1",
            "text" : "Specific substance used",
            "description" : "Is there a history of use of a specific substance or group of substances.",
            "comment" : "In a template, the data element would usually be renamed to the specific question asked. The proposed value set can be adapted for local use by using the DV_TEXT or the DV_BOOLEAN datatypes choice to match each specific use case. For example an alternative valueset using the DV_TEXT datatype can be: Currently using [The individual currently uses the specific substance either on a regular basis or as required.] Never used [The individual has never used the specific substance.] Used in the past [The individual has used the specific substance in the past, but isn't currently using it.] Unknown [It is not known whether the individual uses or has used the specific substance.]"
          },
          "ac0.4" : {
            "@type" : "ARCHETYPE_TERM",
            "text" : "(Synthesized)",
            "code" : "ac0.4",
            "description" : ""
          },
          "at0002.1" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0002.1",
            "text" : "Date of onset",
            "description" : "The onset, cessation or duration of use of the substance or grouping of substances.",
            "comment" : "The 'Timing' data element has deliberately been loosely modelled to support the myriad of ways that it can be used in questionnaires to capture when a substance was used. The specific and intended semantics can be further clarified in a template. For example: Clone and rename the element in a template to 'Start' and 'Stopped' to record the Date/time when the individual started using a substance. Interval of date/time for a period of time eg. between 1940 and 1942. Text for descriptions like 'Immediately after the operation', or 'Up to one week ago', 'Up to two weeks ago', 'Three weeks ago'. Duration for the individual's age at the onset of duration OR the length of time during which the individual has been using the substance. Interval of Duration for the approximate age of the individual at the time of onset."
          },
          "at0027.2" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0027.2",
            "text" : "Concomitant medication used to treat substance abuse ?",
            "description" : "Is there a history of use of any substance related to the screening purpose?",
            "comment" : "In a template, the data element would usually be renamed to the specific question asked. The proposed value set can be adapted for local use by using the DV_TEXT or the DV_BOOLEAN datatypes choice to match each specific use case."
          }
        },
        "nb" : {
          "ac0.4" : {
            "@type" : "ARCHETYPE_TERM",
            "text" : "*(Synthesized) (en)",
            "code" : "ac0.4",
            "description" : ""
          },
          "at0000.1" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0000",
            "text" : "Spørreskjema om stoffbruk (3)",
            "description" : "Spørsmål og tilhørende svar som brukes til å kartlegge skadelig eller farlig bruk av legemidler og andre lovlige og ulovlige stoffer.",
            "comment" : "Også kjent som stoffmisbruk, og inneholder avhengighet til substanser, avhengighet og doping. Eksempler på substanser kan være men er ikke begrenset til, alkohol, tobakk, amfetamin, barbiturater, bensodiasepiner, kannabis, kokain, hallusinogener, opioider, anabole steroider, erythropoetin og lim."
          },
          "at0027.2" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0027",
            "text" : "Bruk av noen substanser? (2)",
            "description" : "Finnes det noen tidligere substansbruk som er innenfor kartleggingsformålet?",
            "comment" : "Navnet på dataelementet kan omformuleres til det spesifikke spørsmålet i et templat eller brukergrensesnitt. Det foreslåtte verdisettet kan tilpasses/endres i det enkelte bruksområde ved å benytte de alternative datatypene DV_TEXT eller DV_BOOLEAN."
          }
        },
        "de" : {
          "ac0.4" : {
            "@type" : "ARCHETYPE_TERM",
            "text" : "*(Synthesized) (en)",
            "code" : "ac0.4",
            "description" : ""
          },
          "at0000.1" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0000",
            "text" : "*Substance use screening questionnaire (en) (3)",
            "description" : "*Series of questions and associated answers used to screen for the harmful or hazardous use of medications, and other legal and illegal substances. (en)",
            "comment" : "*Also known as substance abuse, and includes substance dependence, addiction and doping. Examples of substances include, but are not limited to, alcohol, tobacco, amphetamines, barbiturates, benzodiazepines, cannabis, cocaine, hallucinogens, opioids, anabolic steroids, erythropoietin, or sniffing glue. (en)"
          },
          "at0027.2" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0027",
            "text" : "*Any substance used? (en) (2)",
            "description" : "Wendet die Person irgendein Medikament an?",
            "comment" : "*In a template, the data element would usually be renamed to the specific question asked. The proposed value set can be adapted for local use by using the DV_TEXT or the DV_BOOLEAN datatypes choice to match each specific use case. (en)"
          }
        },
        "nl" : {
          "ac0.4" : {
            "@type" : "ARCHETYPE_TERM",
            "text" : "*(Synthesized) (en)",
            "code" : "ac0.4",
            "description" : ""
          },
          "at0000.1" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0000",
            "text" : "*Substance use screening questionnaire (en) (3)",
            "description" : "*Series of questions and associated answers used to screen for the harmful or hazardous use of medications, and other legal and illegal substances. (en)",
            "comment" : "*Also known as substance abuse, and includes substance dependence, addiction and doping. Examples of substances include, but are not limited to, alcohol, tobacco, amphetamines, barbiturates, benzodiazepines, cannabis, cocaine, hallucinogens, opioids, anabolic steroids, erythropoietin, or sniffing glue. (en)"
          },
          "at0027.2" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0027",
            "text" : "*Any substance used? (en) (2)",
            "description" : "Gebruikt het individu enige medicatie?",
            "comment" : "*In a template, the data element would usually be renamed to the specific question asked. The proposed value set can be adapted for local use by using the DV_TEXT or the DV_BOOLEAN datatypes choice to match each specific use case. (en)"
          }
        }
      },
      "termBindings" : { },
      "terminologyExtracts" : { },
      "valueSets" : {
        "ac0.1" : {
          "@type" : "VALUE_SET",
          "id" : "ac0.1",
          "members" : [ "at0028", "at0029", "at0030" ]
        },
        "ac0.2" : {
          "@type" : "VALUE_SET",
          "id" : "ac0.2",
          "members" : [ "at0028", "at0029", "at0030" ]
        },
        "ac0.3" : {
          "@type" : "VALUE_SET",
          "id" : "ac0.3",
          "members" : [ "at0028", "at0029", "at0030" ]
        },
        "ac0.4" : {
          "@type" : "VALUE_SET",
          "id" : "ac0.4",
          "members" : [ "at0028", "at0029", "at0030" ]
        },
        "ac0.5" : {
          "@type" : "VALUE_SET",
          "id" : "ac0.5",
          "members" : [ "at0036", "at0037", "at0039" ]
        },
        "ac0.6" : {
          "@type" : "VALUE_SET",
          "id" : "ac0.6",
          "members" : [ "at0028", "at0029", "at0030" ]
        }
      }
    },
    "adlVersion" : "1.4",
    "buildUid" : "4a3703b7-5817-4527-9c1e-a22eb5f51a8e",
    "rmName" : "openehr",
    "rmRelease" : "1.1.0",
    "generated" : true,
    "otherMetaData" : { },
    "originalLanguage" : {
      "terminologyId" : {
        "value" : "ISO_639-1"
      },
      "codeString" : "en"
    },
    "translations" : [ {
      "@type" : "TRANSLATION_DETAILS",
      "language" : {
        "terminologyId" : {
          "value" : "ISO_639-1"
        },
        "codeString" : "de"
      },
      "author" : {
        "name" : "Kim Sommer, Natalia Strauch, Alina Rehberg",
        "organisation" : "Medizinische Hochschule Hannover",
        "email" : "sommer.kimkatrin@mh-hannover.de, Strauch.Natalia@mh-hannover.de, rehberg.alina@mh-hannover.de"
      },
      "otherDetails" : { }
    }, {
      "@type" : "TRANSLATION_DETAILS",
      "language" : {
        "terminologyId" : {
          "value" : "ISO_639-1"
        },
        "codeString" : "nb"
      },
      "author" : {
        "name" : "Silje Ljosland Bakke, Marit Alice Venheim, John Tore Valand",
        "organisation" : "Helse Vest IKT AS, Helse Bergen",
        "email" : "silje.ljosland.bakke@helse-vest-ikt.no, marit.alice.venheim@helse-vest-ikt.no, john.tore.valand@helse-bergen.no, john.tore.valand@helse-vest-ikt.no"
      },
      "otherDetails" : { }
    }, {
      "@type" : "TRANSLATION_DETAILS",
      "language" : {
        "terminologyId" : {
          "value" : "ISO_639-1"
        },
        "codeString" : "nl"
      },
      "author" : {
        "name" : "Martijn van Eenennaam",
        "organisation" : "Nedap Healthcare",
        "email" : "martijn.vaneenennaam@nedap.com"
      },
      "accreditation" : "PhD",
      "otherDetails" : { }
    } ]
  }, {
    "@type" : "TEMPLATE_OVERLAY",
    "uid" : "29081ad4-8389-4911-ac92-52b4d2de0d28",
    "description" : {
      "@type" : "RESOURCE_DESCRIPTION",
      "originalAuthor" : { },
      "otherContributors" : [ ],
      "ipAcknowledgements" : { },
      "references" : { },
      "conversionDetails" : { },
      "otherDetails" : {
        "PARENT:MD5-CAM-1.0.1" : "60834FB342B68A169ADF87DE620BC29D"
      },
      "details" : {
        "de" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "de"
          },
          "purpose" : "*To create a framework for recording answers to pre-defined screening questions about the use of any specified substance or a grouping of substances. (en)",
          "keywords" : [ "*substance, screening, questionnaire, drug (en)" ],
          "use" : "*Use to create a framework for recording answers to pre-defined screening questions about the use of any specified substance or a grouping of substances.\r\n\r\nCommon use cases include, but are not limited to:\r\n- Systematic questioning in any consultation, for example:\r\n--- Do you smoke? Yes, No, Unknown\r\n--- For how long have you been smoking?\r\n--- Do you use any illegal substances? Yes, No, Unknown.\r\n--- Have you been drinking alcohol the last four weeks? Yes, No, Unknown.\r\n- Specific questioning related to substance use.\r\n\r\n\t\r\nUse to create a framework for recording answers to pre-defined screening questions about the use of any specified medication or grouping (including classes) of medications.\r\n\r\nExamples of medications, groupings and classes of medications are 'alendronic acid', 'anti osteoporosis medications' and 'bisphosphonates', respectively.\r\n\r\nCommon use cases include, but are not limited to:\r\n- Systematic questioning in any consultation related to patterns of medication usage, for example:\r\n--- Do you use paracetamol? Yes, No, Unknown.\r\n--- Have you been using any anticoagulants the last four weeks? Yes, No, Unknown.\r\n\r\nThe semantics of this archetype are intentionally loose, and querying this archetype would normally only be useful or safe within the context of each specific template. In a template, each data element would usually be renamed to the specific question asked. Where value sets have been proposed for common use cases, these can be adapted for local use by using the DV_TEXT or the DV_BOOLEAN datatypes choice to match each specific use case.\r\n\r\nThe EVENT structure from the reference model can be used to specify whether the questions relate to point in time or over a period of time. Use a separate instance of this archetype to distinguish between a questionnaire recording information about a medication that has been used at any time in the past and information about a medication used within a specified time interval - for example the difference between \"Do you drink alcohol?\" compared to \"Have you been drinking any alcohol during the last four weeks?\". \r\n\r\nThe source of the information in a questionnaire response may vary in different contexts but can be specifically identified using the 'Information provider' element in the Reference Model.\r\n\r\nThis archetype has been designed to be used as a screening tool or to record simple questionnaire-format data for use in situations such as a disease registry. If the screening questionnaire identifies the presence of a substance it is recommended that clinical system record and persist the specific details about the substance using a relevant archetype, for example the EVALUATION.tobacco_smoking_summary or the EVALUATION.substance_use_summary. (en)",
          "misuse" : "*Not to be used for recording a summary of use of a substance over the lifetime of the individual - use EVALUATION.substance_use_summary for this purpose.\r\n\r\nNot to be used for recording a summary of use of tobacco over the lifetime of the individual - use EVALUATION.smokeless_tobacco_summary or EVALUATION.tobacco_smoking_summary for this purpose.\r\n\r\nNot to be used for recording a summary of use of alcohol over the lifetime of the individual - use EVALUATION.alcohol_consumption_summary for this purpose.\r\n\r\nNot to be used for recording information about the use of a medication. Use a relevant medication archetype for this purpose.\r\n\r\nNot to be used to record details about a simple selection list where a question may be recorded as either \"present\" or \"indeterminate\". Use OBSERVATION.selection_list for this purpose. (en)",
          "copyright" : "© openEHR Foundation, Nasjonal IKT HF, openEHR Foundation, openEHR Foundation",
          "originalResourceUri" : { },
          "otherDetails" : { }
        },
        "nb" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "nb"
          },
          "purpose" : "For å lage et rammeverk for registrering av svar på forhåndsdefinerte spørsmål om skadelig eller farlig bruk av legemidler og andre lovlige og ulovlige stoffer.",
          "keywords" : [ "intervjuskjema, kartleggingskjema, spørreskjema, dop" ],
          "use" : "Brukes for å lage et rammeverk for registrering av svar på forhåndsdefinerte spørsmål om skadelig eller farlig bruk av legemidler og andre lovlige og ulovlige stoffer.\r\n\r\nVanlige bruksområder inkluderer, men er ikke begrenset til:\r\n- Systematiske spørsmål ved konsultasjoner, for eksempel:\r\n--- Røyker du? Ja, Nei, Usikker.\r\n--- Hvor lenge har du røyket?\r\n--- Har du noen sinne injisert rusmidler? Ja, Nei, Usikker.\r\n--- Bruker du prestasjonsfremmende substanser? Ja, Nei, Usikker.\r\n--- Har du drukket alkohol de siste fire ukene? Ja, Nei, Usikker.\r\n- Spørsmål relatert til bruken av spesifikke substanser.\r\n\r\nSemantikken til denne arketypen er med vilje løst definert, og spørringer etter data i denne arketypen vil normalt bare være hensiktsmessig eller sikkert i konteksten av det spesifikke templatet. I et templat vil hvert dataelement vanligvis døpes om til det (spesifikke) spørsmålet man ønsker svar på. Flere steder er det foreslått verdisett som passer til de vanligste bruksområder, men det er allikevel mulig å tilpasse/endre verdisett for lokal bruk ved å benytte de alternative datatypene DV_TEXT eller DV_BOOLEAN for å harmonere verdisettet til hvert enkelt brukstilfelle.\r\n\r\nEVENT-strukturen fra arketypens referansemodell kan brukes for å spesifisere om spørsmålene relateres til et tidspunkt eller til et tidsintervall.\r\nBruk egne instanser av denne arketypen for å skille mellom spørsmål om prosedyrer som er gjennomførte på et hvilket som helst tidspunkt og spørsmål om prosedyrer som er gjennomført i et tidsintervall. For eksempel; \"Bruker du rusmidler?\" sammenlignet med \"Har du brukt rusmidler de siste fire ukene?\".\r\n\r\nKilden til informasjonen i et spørreskjema kan variere i ulike kontekster, men kan identifiseres spesifikt ved å benytte \"Information provider\" elementet i openEHR referansemodellen.\r\n\r\nDenne arketypen er laget for å bli brukt i et spørreskjema eller for å registrere enkle strukturerte data til for eksempel et sykdomsregister. Dersom det i spørreskjemaet identifiseres at bruken av en substans er tilstede, anbefales det at spesifikke detaljer om substansen registreres og lagres i pasientjournalen i en relevant arketype, for eksempel i arketypene EVALUATION.tobacco_smoking_summary eller EVALUATION.substance_use_summary.",
          "misuse" : "Brukes ikke for å registrere et sammendrag av bruken av en substans over et individs livstid, bruk arketypen EVALUATION.substance_use_summary for dette formålet.\r\n\r\nBrukes ikke for å registrere et sammendrag av bruken av tobakk over et individs livstid, bruk arketypen EVALUATION.smokeless_tobacco_summary eller EVALUATION.tobacco_smoking_summary for dette formålet.\r\n\r\nBrukes ikke for å registrere et sammendrag av bruken av tobakk over et individs livstid, bruk arketypen EVALUATION.alcohol_consumption_summary for dette formålet.\r\n\r\nBrukes ikke for å registrere hendelses- eller periodebasert informasjon om bruken av en substans utenfor konteksten av kartleggingen. Bruke en relevant OBSERVATION-arketype for dette formålet.",
          "copyright" : "© openEHR Foundation, Nasjonal IKT HF, openEHR Foundation, openEHR Foundation",
          "originalResourceUri" : { },
          "otherDetails" : { }
        },
        "en" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "en"
          },
          "purpose" : "To create a framework for recording answers to pre-defined screening questions about the harmful or hazardous use of medications, and other legal and illegal substances.\r\n",
          "keywords" : [ "substance, screening, questionnaire, drug" ],
          "use" : "Use to create a framework for recording answers to pre-defined screening questions about the use of any specified substance or a grouping of substances without a prescription or beyond its intended scope or expected use.\r\n\r\nCommon use cases include, but are not limited to:\r\n- Systematic questioning in any consultation, for example:\r\n--- Do you smoke? Yes, No, Unknown\r\n--- For how long have you been smoking?\r\n--- Have you ever injected drugs? Yes, No, Unknown.\r\n--- Do you use performance enhancing substances? Yes, No, Unknown.\r\n--- Have you been drinking alcohol the last four weeks? Yes, No, Unknown.\r\n- Questions related to use of specific substances.\t\r\n\r\nThe semantics of this archetype are intentionally loose, and querying this archetype would normally only be useful or safe within the context of each specific template. In a template, each data element would usually be renamed to the specific question asked. Where value sets have been proposed for common use cases, these can be adapted for local use by using the DV_TEXT or the DV_BOOLEAN datatypes choice to match each specific use case.\r\n\r\nThe EVENT structure from the reference model can be used to specify whether the questions relate to point in time or over a period of time. Use a separate instance of this archetype to distinguish between a questionnaire recording information about a medication that has been used at any time in the past and information about a medication used within a specified time interval - for example the difference between \"Do you drink alcohol?\" compared to \"Have you been drinking any alcohol during the last four weeks?\". \r\n\r\nThe source of the information in a questionnaire response may vary in different contexts but can be specifically identified using the 'Information provider' element in the Reference Model.\r\n\r\nThis archetype has been designed to be used as a screening tool or to record simple questionnaire-format data for use in situations such as a disease registry. If the screening questionnaire identifies the presence of a substance it is recommended that clinical system record and persist the specific details about the substance using a relevant archetype, for example the EVALUATION.tobacco_smoking_summary or the EVALUATION.substance_use_summary archetypes.",
          "misuse" : "Not to be used for recording a summary of use of a substance over the lifetime of the individual - use EVALUATION.substance_use_summary for this purpose.\r\n\r\nNot to be used for recording a summary of use of tobacco over the lifetime of the individual - use EVALUATION.smokeless_tobacco_summary or EVALUATION.tobacco_smoking_summary for this purpose.\r\n\r\nNot to be used for recording a summary of use of alcohol over the lifetime of the individual - use EVALUATION.alcohol_consumption_summary for this purpose.\r\n\r\nNot to be used to record event-or period-based information about the use of a substance, outside of a screening context - use a relevant OBSERVATION.archetype for this purpose.\r\n\r\nNot to be used for recording information about the use of a medication, putside of a screening context. Use a relevant medication archetype for this purpose.",
          "copyright" : "© openEHR Foundation, Nasjonal IKT HF",
          "originalResourceUri" : { },
          "otherDetails" : { }
        },
        "nl" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "nl"
          },
          "purpose" : "*To create a framework for recording answers to pre-defined screening questions about the use of any specified substance or a grouping of substances. (en)",
          "keywords" : [ "*substance, screening, questionnaire, drug (en)" ],
          "use" : "*Use to create a framework for recording answers to pre-defined screening questions about the use of any specified substance or a grouping of substances.\r\n\r\nCommon use cases include, but are not limited to:\r\n- Systematic questioning in any consultation, for example:\r\n--- Do you smoke? Yes, No, Unknown\r\n--- For how long have you been smoking?\r\n--- Do you use any illegal substances? Yes, No, Unknown.\r\n--- Have you been drinking alcohol the last four weeks? Yes, No, Unknown.\r\n- Specific questioning related to substance use.\r\n\r\n\t\r\nUse to create a framework for recording answers to pre-defined screening questions about the use of any specified medication or grouping (including classes) of medications.\r\n\r\nExamples of medications, groupings and classes of medications are 'alendronic acid', 'anti osteoporosis medications' and 'bisphosphonates', respectively.\r\n\r\nCommon use cases include, but are not limited to:\r\n- Systematic questioning in any consultation related to patterns of medication usage, for example:\r\n--- Do you use paracetamol? Yes, No, Unknown.\r\n--- Have you been using any anticoagulants the last four weeks? Yes, No, Unknown.\r\n\r\nThe semantics of this archetype are intentionally loose, and querying this archetype would normally only be useful or safe within the context of each specific template. In a template, each data element would usually be renamed to the specific question asked. Where value sets have been proposed for common use cases, these can be adapted for local use by using the DV_TEXT or the DV_BOOLEAN datatypes choice to match each specific use case.\r\n\r\nThe EVENT structure from the reference model can be used to specify whether the questions relate to point in time or over a period of time. Use a separate instance of this archetype to distinguish between a questionnaire recording information about a medication that has been used at any time in the past and information about a medication used within a specified time interval - for example the difference between \"Do you drink alcohol?\" compared to \"Have you been drinking any alcohol during the last four weeks?\". \r\n\r\nThe source of the information in a questionnaire response may vary in different contexts but can be specifically identified using the 'Information provider' element in the Reference Model.\r\n\r\nThis archetype has been designed to be used as a screening tool or to record simple questionnaire-format data for use in situations such as a disease registry. If the screening questionnaire identifies the presence of a substance it is recommended that clinical system record and persist the specific details about the substance using a relevant archetype, for example the EVALUATION.tobacco_smoking_summary or the EVALUATION.substance_use_summary. (en)",
          "misuse" : "*Not to be used for recording a summary of use of a substance over the lifetime of the individual - use EVALUATION.substance_use_summary for this purpose.\r\n\r\nNot to be used for recording a summary of use of tobacco over the lifetime of the individual - use EVALUATION.smokeless_tobacco_summary or EVALUATION.tobacco_smoking_summary for this purpose.\r\n\r\nNot to be used for recording a summary of use of alcohol over the lifetime of the individual - use EVALUATION.alcohol_consumption_summary for this purpose.\r\n\r\nNot to be used for recording information about the use of a medication. Use a relevant medication archetype for this purpose.\r\n\r\nNot to be used to record details about a simple selection list where a question may be recorded as either \"present\" or \"indeterminate\". Use OBSERVATION.selection_list for this purpose. (en)",
          "copyright" : "© openEHR Foundation, Nasjonal IKT HF, openEHR Foundation, openEHR Foundation",
          "originalResourceUri" : { },
          "otherDetails" : { }
        }
      }
    },
    "annotations" : {
      "@type" : "RESOURCE_ANNOTATIONS",
      "documentation" : {
        "en" : {
          "/data[at0022]/events[at0023]/data[at0001]/items[at0026.1]/items[at0024.1]" : {
            "redcap_mapping" : "other_sucat"
          },
          "/data[at0022]/events[at0023]/data[at0001]/items[at0027.1]" : {
            "redcap_mapping" : "alcohol_suyn"
          },
          "/data[at0022]/events[at0023]/data[at0001]/items[at0027.2]" : {
            "redcap_mapping" : "regular_alcohol_suyn"
          }
        }
      }
    },
    "parentArchetypeId" : "openEHR-EHR-OBSERVATION.substance_use_screening.v0",
    "differential" : true,
    "archetypeId" : {
      "@type" : "ARCHETYPE_HRID",
      "value" : "openEHR-EHR-OBSERVATION.ovl-substance_use_screening-002.v0"
    },
    "definition" : {
      "@type" : "C_COMPLEX_OBJECT",
      "rmTypeName" : "OBSERVATION",
      "nodeId" : "at0000.1",
      "attributes" : [ {
        "@type" : "C_ATTRIBUTE",
        "rmAttributeName" : "data",
        "children" : [ {
          "@type" : "C_COMPLEX_OBJECT",
          "rmTypeName" : "HISTORY",
          "nodeId" : "at0022",
          "attributes" : [ {
            "@type" : "C_ATTRIBUTE",
            "rmAttributeName" : "events",
            "children" : [ {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "EVENT",
              "nodeId" : "at0023",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "data",
                "children" : [ {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "ITEM_TREE",
                  "nodeId" : "at0001",
                  "attributes" : [ {
                    "@type" : "C_ATTRIBUTE",
                    "rmAttributeName" : "items",
                    "children" : [ {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "ELEMENT",
                      "occurrences" : "0..0",
                      "nodeId" : "at0040.1",
                      "attributes" : [ {
                        "@type" : "C_ATTRIBUTE",
                        "rmAttributeName" : "value",
                        "children" : [ {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "DV_TEXT",
                          "attributes" : [ {
                            "@type" : "C_ATTRIBUTE",
                            "rmAttributeName" : "value",
                            "children" : [ {
                              "@type" : "C_STRING",
                              "rmTypeName" : "STRING",
                              "constraint" : [ "Alcohol consumption screening for IBD" ]
                            } ]
                          } ],
                          "attributeTuples" : [ ]
                        } ]
                      } ],
                      "attributeTuples" : [ ]
                    }, {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "ELEMENT",
                      "nodeId" : "at0027.1",
                      "attributes" : [ {
                        "@type" : "C_ATTRIBUTE",
                        "rmAttributeName" : "value",
                        "children" : [ {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "DV_CODED_TEXT",
                          "attributes" : [ {
                            "@type" : "C_ATTRIBUTE",
                            "rmAttributeName" : "defining_code",
                            "children" : [ {
                              "@type" : "C_TERMINOLOGY_CODE",
                              "rmTypeName" : "TERMINOLOGY_CODE",
                              "occurrences" : "1..1",
                              "terminologyId" : {
                                "value" : "HL7_expandedYes-NoIndicator"
                              },
                              "constraint" : [ ],
                              "selectedTerminologies" : [ "HL7_expandedYes-NoIndicator" ],
                              "includedExternalTerminologyCodes" : [ {
                                "terminologyId" : "HL7_expandedYes-NoIndicator",
                                "code" : "Y",
                                "value" : "Yes"
                              }, {
                                "terminologyId" : "HL7_expandedYes-NoIndicator",
                                "code" : "N",
                                "value" : "No"
                              }, {
                                "terminologyId" : "HL7_expandedYes-NoIndicator",
                                "code" : "UNK",
                                "value" : "Don't know"
                              }, {
                                "terminologyId" : "HL7_expandedYes-NoIndicator",
                                "code" : "REFU",
                                "value" : "Refused"
                              } ]
                            } ]
                          } ],
                          "attributeTuples" : [ ]
                        }, {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "DV_TEXT",
                          "attributes" : [ ],
                          "attributeTuples" : [ ]
                        }, {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "DV_BOOLEAN",
                          "attributes" : [ ],
                          "attributeTuples" : [ ]
                        } ]
                      } ],
                      "attributeTuples" : [ ]
                    }, {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "ELEMENT",
                      "nodeId" : "at0027.2",
                      "attributes" : [ {
                        "@type" : "C_ATTRIBUTE",
                        "rmAttributeName" : "value",
                        "children" : [ {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "DV_CODED_TEXT",
                          "attributes" : [ {
                            "@type" : "C_ATTRIBUTE",
                            "rmAttributeName" : "defining_code",
                            "children" : [ {
                              "@type" : "C_TERMINOLOGY_CODE",
                              "rmTypeName" : "TERMINOLOGY_CODE",
                              "occurrences" : "1..1",
                              "terminologyId" : {
                                "value" : "HL7_expandedYes-NoIndicator"
                              },
                              "constraint" : [ ],
                              "selectedTerminologies" : [ "HL7_expandedYes-NoIndicator" ],
                              "includedExternalTerminologyCodes" : [ {
                                "terminologyId" : "HL7_expandedYes-NoIndicator",
                                "code" : "Y",
                                "value" : "Yes"
                              }, {
                                "terminologyId" : "HL7_expandedYes-NoIndicator",
                                "code" : "N",
                                "value" : "No"
                              }, {
                                "terminologyId" : "HL7_expandedYes-NoIndicator",
                                "code" : "UNK",
                                "value" : "Don't know"
                              }, {
                                "terminologyId" : "HL7_expandedYes-NoIndicator",
                                "code" : "REFU",
                                "value" : "Refused"
                              } ]
                            } ]
                          } ],
                          "attributeTuples" : [ ]
                        }, {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "DV_TEXT",
                          "attributes" : [ ],
                          "attributeTuples" : [ ]
                        }, {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "DV_BOOLEAN",
                          "attributes" : [ ],
                          "attributeTuples" : [ ]
                        } ]
                      } ],
                      "attributeTuples" : [ ]
                    }, {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "ELEMENT",
                      "occurrences" : "0..0",
                      "nodeId" : "at0042.1",
                      "attributes" : [ ],
                      "attributeTuples" : [ ]
                    }, {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "CLUSTER",
                      "occurrences" : "0..0",
                      "nodeId" : "at0026.1",
                      "attributes" : [ {
                        "@type" : "C_ATTRIBUTE",
                        "rmAttributeName" : "items",
                        "children" : [ {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "ELEMENT",
                          "nodeId" : "at0021.1",
                          "attributes" : [ {
                            "@type" : "C_ATTRIBUTE",
                            "rmAttributeName" : "value",
                            "children" : [ {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_TEXT",
                              "attributes" : [ {
                                "@type" : "C_ATTRIBUTE",
                                "rmAttributeName" : "value",
                                "children" : [ {
                                  "@type" : "C_STRING",
                                  "rmTypeName" : "STRING",
                                  "constraint" : [ "Alcohol" ]
                                } ]
                              } ],
                              "attributeTuples" : [ ]
                            } ]
                          } ],
                          "attributeTuples" : [ ]
                        }, {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "ELEMENT",
                          "nodeId" : "at0024.1",
                          "attributes" : [ {
                            "@type" : "C_ATTRIBUTE",
                            "rmAttributeName" : "value",
                            "children" : [ {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_TEXT",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            } ]
                          } ],
                          "attributeTuples" : [ ]
                        } ]
                      } ],
                      "attributeTuples" : [ ]
                    } ]
                  } ],
                  "attributeTuples" : [ ]
                } ]
              } ],
              "attributeTuples" : [ ]
            } ]
          } ],
          "attributeTuples" : [ ]
        } ]
      } ],
      "attributeTuples" : [ ]
    },
    "terminology" : {
      "@type" : "ARCHETYPE_TERMINOLOGY",
      "conceptCode" : "at0000",
      "termDefinitions" : {
        "en" : {
          "at0000.1" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0000.1",
            "text" : "Substance use screening - alcohol",
            "description" : "Series of questions and associated answers used to screen for the harmful or hazardous use of medications, and other legal and illegal substances.",
            "comment" : "Also known as substance abuse, and includes substance dependence, addiction and doping. Examples of substances include, but are not limited to, alcohol, tobacco, amphetamines, barbiturates, benzodiazepines, cannabis, cocaine, hallucinogens, opioids, anabolic steroids, erythropoietin, or sniffing glue."
          },
          "at0027.1" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0027.1",
            "text" : "In patients lifetime, have drunk 100 ml or more alcoholic drinks (beer, wine, liquor, spirits)?",
            "description" : "Is there a history of use of any substance related to the screening purpose?",
            "comment" : "In a template, the data element would usually be renamed to the specific question asked. The proposed value set can be adapted for local use by using the DV_TEXT or the DV_BOOLEAN datatypes choice to match each specific use case."
          },
          "at0027.2" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0027.2",
            "text" : "In patients lifetime, have ever regularly drunk alcohol, at least one drink per week for 6 months or longer?",
            "description" : "Is there a history of use of any substance related to the screening purpose?",
            "comment" : "In a template, the data element would usually be renamed to the specific question asked. The proposed value set can be adapted for local use by using the DV_TEXT or the DV_BOOLEAN datatypes choice to match each specific use case."
          }
        },
        "nb" : {
          "at0000.1" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0000.1",
            "text" : "Spørreskjema om stoffbruk (2)",
            "description" : "Spørsmål og tilhørende svar som brukes til å kartlegge skadelig eller farlig bruk av legemidler og andre lovlige og ulovlige stoffer.",
            "comment" : "Også kjent som stoffmisbruk, og inneholder avhengighet til substanser, avhengighet og doping. Eksempler på substanser kan være men er ikke begrenset til, alkohol, tobakk, amfetamin, barbiturater, bensodiasepiner, kannabis, kokain, hallusinogener, opioider, anabole steroider, erythropoetin og lim."
          },
          "at0027.2" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0027.1",
            "text" : "Bruk av noen substanser? (2)",
            "description" : "Finnes det noen tidligere substansbruk som er innenfor kartleggingsformålet?",
            "comment" : "Navnet på dataelementet kan omformuleres til det spesifikke spørsmålet i et templat eller brukergrensesnitt. Det foreslåtte verdisettet kan tilpasses/endres i det enkelte bruksområde ved å benytte de alternative datatypene DV_TEXT eller DV_BOOLEAN."
          }
        },
        "de" : {
          "at0000.1" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0000.1",
            "text" : "*Substance use screening questionnaire (en) (2)",
            "description" : "*Series of questions and associated answers used to screen for the harmful or hazardous use of medications, and other legal and illegal substances. (en)",
            "comment" : "*Also known as substance abuse, and includes substance dependence, addiction and doping. Examples of substances include, but are not limited to, alcohol, tobacco, amphetamines, barbiturates, benzodiazepines, cannabis, cocaine, hallucinogens, opioids, anabolic steroids, erythropoietin, or sniffing glue. (en)"
          },
          "at0027.2" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0027.1",
            "text" : "*Any substance used? (en) (2)",
            "description" : "Wendet die Person irgendein Medikament an?",
            "comment" : "*In a template, the data element would usually be renamed to the specific question asked. The proposed value set can be adapted for local use by using the DV_TEXT or the DV_BOOLEAN datatypes choice to match each specific use case. (en)"
          }
        },
        "nl" : {
          "at0000.1" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0000.1",
            "text" : "*Substance use screening questionnaire (en) (2)",
            "description" : "*Series of questions and associated answers used to screen for the harmful or hazardous use of medications, and other legal and illegal substances. (en)",
            "comment" : "*Also known as substance abuse, and includes substance dependence, addiction and doping. Examples of substances include, but are not limited to, alcohol, tobacco, amphetamines, barbiturates, benzodiazepines, cannabis, cocaine, hallucinogens, opioids, anabolic steroids, erythropoietin, or sniffing glue. (en)"
          },
          "at0027.2" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0027.1",
            "text" : "*Any substance used? (en) (2)",
            "description" : "Gebruikt het individu enige medicatie?",
            "comment" : "*In a template, the data element would usually be renamed to the specific question asked. The proposed value set can be adapted for local use by using the DV_TEXT or the DV_BOOLEAN datatypes choice to match each specific use case. (en)"
          }
        }
      },
      "termBindings" : { },
      "terminologyExtracts" : { },
      "valueSets" : {
        "ac0.2" : {
          "@type" : "VALUE_SET",
          "id" : "ac0.2",
          "members" : [ "at0028", "at0029", "at0030" ]
        },
        "ac0.3" : {
          "@type" : "VALUE_SET",
          "id" : "ac0.3",
          "members" : [ ]
        },
        "ac0.4" : {
          "@type" : "VALUE_SET",
          "id" : "ac0.4",
          "members" : [ ]
        },
        "ac0.6" : {
          "@type" : "VALUE_SET",
          "id" : "ac0.6",
          "members" : [ "at0028", "at0029", "at0030" ]
        },
        "ac0.7" : {
          "@type" : "VALUE_SET",
          "id" : "ac0.7",
          "members" : [ ]
        },
        "ac0.8" : {
          "@type" : "VALUE_SET",
          "id" : "ac0.8",
          "members" : [ ]
        }
      }
    },
    "adlVersion" : "1.4",
    "buildUid" : "4a3703b7-5817-4527-9c1e-a22eb5f51a8e",
    "rmName" : "openehr",
    "rmRelease" : "1.1.0",
    "generated" : true,
    "otherMetaData" : { },
    "originalLanguage" : {
      "terminologyId" : {
        "value" : "ISO_639-1"
      },
      "codeString" : "en"
    },
    "translations" : [ {
      "@type" : "TRANSLATION_DETAILS",
      "language" : {
        "terminologyId" : {
          "value" : "ISO_639-1"
        },
        "codeString" : "de"
      },
      "author" : {
        "name" : "Kim Sommer, Natalia Strauch, Alina Rehberg",
        "organisation" : "Medizinische Hochschule Hannover",
        "email" : "sommer.kimkatrin@mh-hannover.de, Strauch.Natalia@mh-hannover.de, rehberg.alina@mh-hannover.de"
      },
      "otherDetails" : { }
    }, {
      "@type" : "TRANSLATION_DETAILS",
      "language" : {
        "terminologyId" : {
          "value" : "ISO_639-1"
        },
        "codeString" : "nb"
      },
      "author" : {
        "name" : "Silje Ljosland Bakke, Marit Alice Venheim, John Tore Valand",
        "organisation" : "Helse Vest IKT AS, Helse Bergen",
        "email" : "silje.ljosland.bakke@helse-vest-ikt.no, marit.alice.venheim@helse-vest-ikt.no, john.tore.valand@helse-bergen.no, john.tore.valand@helse-vest-ikt.no"
      },
      "otherDetails" : { }
    }, {
      "@type" : "TRANSLATION_DETAILS",
      "language" : {
        "terminologyId" : {
          "value" : "ISO_639-1"
        },
        "codeString" : "nl"
      },
      "author" : {
        "name" : "Martijn van Eenennaam",
        "organisation" : "Nedap Healthcare",
        "email" : "martijn.vaneenennaam@nedap.com"
      },
      "accreditation" : "PhD",
      "otherDetails" : { }
    } ]
  }, {
    "@type" : "TEMPLATE_OVERLAY",
    "uid" : "09695dbb-b62f-4ba1-9acb-9458f5bb05db",
    "description" : {
      "@type" : "RESOURCE_DESCRIPTION",
      "originalAuthor" : { },
      "otherContributors" : [ ],
      "ipAcknowledgements" : { },
      "references" : { },
      "conversionDetails" : { },
      "otherDetails" : {
        "PARENT:MD5-CAM-1.0.1" : "60834FB342B68A169ADF87DE620BC29D"
      },
      "details" : {
        "de" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "de"
          },
          "purpose" : "*To create a framework for recording answers to pre-defined screening questions about the use of any specified substance or a grouping of substances. (en)",
          "keywords" : [ "*substance, screening, questionnaire, drug (en)" ],
          "use" : "*Use to create a framework for recording answers to pre-defined screening questions about the use of any specified substance or a grouping of substances.\r\n\r\nCommon use cases include, but are not limited to:\r\n- Systematic questioning in any consultation, for example:\r\n--- Do you smoke? Yes, No, Unknown\r\n--- For how long have you been smoking?\r\n--- Do you use any illegal substances? Yes, No, Unknown.\r\n--- Have you been drinking alcohol the last four weeks? Yes, No, Unknown.\r\n- Specific questioning related to substance use.\r\n\r\n\t\r\nUse to create a framework for recording answers to pre-defined screening questions about the use of any specified medication or grouping (including classes) of medications.\r\n\r\nExamples of medications, groupings and classes of medications are 'alendronic acid', 'anti osteoporosis medications' and 'bisphosphonates', respectively.\r\n\r\nCommon use cases include, but are not limited to:\r\n- Systematic questioning in any consultation related to patterns of medication usage, for example:\r\n--- Do you use paracetamol? Yes, No, Unknown.\r\n--- Have you been using any anticoagulants the last four weeks? Yes, No, Unknown.\r\n\r\nThe semantics of this archetype are intentionally loose, and querying this archetype would normally only be useful or safe within the context of each specific template. In a template, each data element would usually be renamed to the specific question asked. Where value sets have been proposed for common use cases, these can be adapted for local use by using the DV_TEXT or the DV_BOOLEAN datatypes choice to match each specific use case.\r\n\r\nThe EVENT structure from the reference model can be used to specify whether the questions relate to point in time or over a period of time. Use a separate instance of this archetype to distinguish between a questionnaire recording information about a medication that has been used at any time in the past and information about a medication used within a specified time interval - for example the difference between \"Do you drink alcohol?\" compared to \"Have you been drinking any alcohol during the last four weeks?\". \r\n\r\nThe source of the information in a questionnaire response may vary in different contexts but can be specifically identified using the 'Information provider' element in the Reference Model.\r\n\r\nThis archetype has been designed to be used as a screening tool or to record simple questionnaire-format data for use in situations such as a disease registry. If the screening questionnaire identifies the presence of a substance it is recommended that clinical system record and persist the specific details about the substance using a relevant archetype, for example the EVALUATION.tobacco_smoking_summary or the EVALUATION.substance_use_summary. (en)",
          "misuse" : "*Not to be used for recording a summary of use of a substance over the lifetime of the individual - use EVALUATION.substance_use_summary for this purpose.\r\n\r\nNot to be used for recording a summary of use of tobacco over the lifetime of the individual - use EVALUATION.smokeless_tobacco_summary or EVALUATION.tobacco_smoking_summary for this purpose.\r\n\r\nNot to be used for recording a summary of use of alcohol over the lifetime of the individual - use EVALUATION.alcohol_consumption_summary for this purpose.\r\n\r\nNot to be used for recording information about the use of a medication. Use a relevant medication archetype for this purpose.\r\n\r\nNot to be used to record details about a simple selection list where a question may be recorded as either \"present\" or \"indeterminate\". Use OBSERVATION.selection_list for this purpose. (en)",
          "copyright" : "© openEHR Foundation, Nasjonal IKT HF, openEHR Foundation, openEHR Foundation",
          "originalResourceUri" : { },
          "otherDetails" : { }
        },
        "nb" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "nb"
          },
          "purpose" : "For å lage et rammeverk for registrering av svar på forhåndsdefinerte spørsmål om skadelig eller farlig bruk av legemidler og andre lovlige og ulovlige stoffer.",
          "keywords" : [ "intervjuskjema, kartleggingskjema, spørreskjema, dop" ],
          "use" : "Brukes for å lage et rammeverk for registrering av svar på forhåndsdefinerte spørsmål om skadelig eller farlig bruk av legemidler og andre lovlige og ulovlige stoffer.\r\n\r\nVanlige bruksområder inkluderer, men er ikke begrenset til:\r\n- Systematiske spørsmål ved konsultasjoner, for eksempel:\r\n--- Røyker du? Ja, Nei, Usikker.\r\n--- Hvor lenge har du røyket?\r\n--- Har du noen sinne injisert rusmidler? Ja, Nei, Usikker.\r\n--- Bruker du prestasjonsfremmende substanser? Ja, Nei, Usikker.\r\n--- Har du drukket alkohol de siste fire ukene? Ja, Nei, Usikker.\r\n- Spørsmål relatert til bruken av spesifikke substanser.\r\n\r\nSemantikken til denne arketypen er med vilje løst definert, og spørringer etter data i denne arketypen vil normalt bare være hensiktsmessig eller sikkert i konteksten av det spesifikke templatet. I et templat vil hvert dataelement vanligvis døpes om til det (spesifikke) spørsmålet man ønsker svar på. Flere steder er det foreslått verdisett som passer til de vanligste bruksområder, men det er allikevel mulig å tilpasse/endre verdisett for lokal bruk ved å benytte de alternative datatypene DV_TEXT eller DV_BOOLEAN for å harmonere verdisettet til hvert enkelt brukstilfelle.\r\n\r\nEVENT-strukturen fra arketypens referansemodell kan brukes for å spesifisere om spørsmålene relateres til et tidspunkt eller til et tidsintervall.\r\nBruk egne instanser av denne arketypen for å skille mellom spørsmål om prosedyrer som er gjennomførte på et hvilket som helst tidspunkt og spørsmål om prosedyrer som er gjennomført i et tidsintervall. For eksempel; \"Bruker du rusmidler?\" sammenlignet med \"Har du brukt rusmidler de siste fire ukene?\".\r\n\r\nKilden til informasjonen i et spørreskjema kan variere i ulike kontekster, men kan identifiseres spesifikt ved å benytte \"Information provider\" elementet i openEHR referansemodellen.\r\n\r\nDenne arketypen er laget for å bli brukt i et spørreskjema eller for å registrere enkle strukturerte data til for eksempel et sykdomsregister. Dersom det i spørreskjemaet identifiseres at bruken av en substans er tilstede, anbefales det at spesifikke detaljer om substansen registreres og lagres i pasientjournalen i en relevant arketype, for eksempel i arketypene EVALUATION.tobacco_smoking_summary eller EVALUATION.substance_use_summary.",
          "misuse" : "Brukes ikke for å registrere et sammendrag av bruken av en substans over et individs livstid, bruk arketypen EVALUATION.substance_use_summary for dette formålet.\r\n\r\nBrukes ikke for å registrere et sammendrag av bruken av tobakk over et individs livstid, bruk arketypen EVALUATION.smokeless_tobacco_summary eller EVALUATION.tobacco_smoking_summary for dette formålet.\r\n\r\nBrukes ikke for å registrere et sammendrag av bruken av tobakk over et individs livstid, bruk arketypen EVALUATION.alcohol_consumption_summary for dette formålet.\r\n\r\nBrukes ikke for å registrere hendelses- eller periodebasert informasjon om bruken av en substans utenfor konteksten av kartleggingen. Bruke en relevant OBSERVATION-arketype for dette formålet.",
          "copyright" : "© openEHR Foundation, Nasjonal IKT HF, openEHR Foundation, openEHR Foundation",
          "originalResourceUri" : { },
          "otherDetails" : { }
        },
        "en" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "en"
          },
          "purpose" : "To create a framework for recording answers to pre-defined screening questions about the harmful or hazardous use of medications, and other legal and illegal substances.\r\n",
          "keywords" : [ "substance, screening, questionnaire, drug" ],
          "use" : "Use to create a framework for recording answers to pre-defined screening questions about the use of any specified substance or a grouping of substances without a prescription or beyond its intended scope or expected use.\r\n\r\nCommon use cases include, but are not limited to:\r\n- Systematic questioning in any consultation, for example:\r\n--- Do you smoke? Yes, No, Unknown\r\n--- For how long have you been smoking?\r\n--- Have you ever injected drugs? Yes, No, Unknown.\r\n--- Do you use performance enhancing substances? Yes, No, Unknown.\r\n--- Have you been drinking alcohol the last four weeks? Yes, No, Unknown.\r\n- Questions related to use of specific substances.\t\r\n\r\nThe semantics of this archetype are intentionally loose, and querying this archetype would normally only be useful or safe within the context of each specific template. In a template, each data element would usually be renamed to the specific question asked. Where value sets have been proposed for common use cases, these can be adapted for local use by using the DV_TEXT or the DV_BOOLEAN datatypes choice to match each specific use case.\r\n\r\nThe EVENT structure from the reference model can be used to specify whether the questions relate to point in time or over a period of time. Use a separate instance of this archetype to distinguish between a questionnaire recording information about a medication that has been used at any time in the past and information about a medication used within a specified time interval - for example the difference between \"Do you drink alcohol?\" compared to \"Have you been drinking any alcohol during the last four weeks?\". \r\n\r\nThe source of the information in a questionnaire response may vary in different contexts but can be specifically identified using the 'Information provider' element in the Reference Model.\r\n\r\nThis archetype has been designed to be used as a screening tool or to record simple questionnaire-format data for use in situations such as a disease registry. If the screening questionnaire identifies the presence of a substance it is recommended that clinical system record and persist the specific details about the substance using a relevant archetype, for example the EVALUATION.tobacco_smoking_summary or the EVALUATION.substance_use_summary archetypes.",
          "misuse" : "Not to be used for recording a summary of use of a substance over the lifetime of the individual - use EVALUATION.substance_use_summary for this purpose.\r\n\r\nNot to be used for recording a summary of use of tobacco over the lifetime of the individual - use EVALUATION.smokeless_tobacco_summary or EVALUATION.tobacco_smoking_summary for this purpose.\r\n\r\nNot to be used for recording a summary of use of alcohol over the lifetime of the individual - use EVALUATION.alcohol_consumption_summary for this purpose.\r\n\r\nNot to be used to record event-or period-based information about the use of a substance, outside of a screening context - use a relevant OBSERVATION.archetype for this purpose.\r\n\r\nNot to be used for recording information about the use of a medication, putside of a screening context. Use a relevant medication archetype for this purpose.",
          "copyright" : "© openEHR Foundation, Nasjonal IKT HF",
          "originalResourceUri" : { },
          "otherDetails" : { }
        },
        "nl" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "nl"
          },
          "purpose" : "*To create a framework for recording answers to pre-defined screening questions about the use of any specified substance or a grouping of substances. (en)",
          "keywords" : [ "*substance, screening, questionnaire, drug (en)" ],
          "use" : "*Use to create a framework for recording answers to pre-defined screening questions about the use of any specified substance or a grouping of substances.\r\n\r\nCommon use cases include, but are not limited to:\r\n- Systematic questioning in any consultation, for example:\r\n--- Do you smoke? Yes, No, Unknown\r\n--- For how long have you been smoking?\r\n--- Do you use any illegal substances? Yes, No, Unknown.\r\n--- Have you been drinking alcohol the last four weeks? Yes, No, Unknown.\r\n- Specific questioning related to substance use.\r\n\r\n\t\r\nUse to create a framework for recording answers to pre-defined screening questions about the use of any specified medication or grouping (including classes) of medications.\r\n\r\nExamples of medications, groupings and classes of medications are 'alendronic acid', 'anti osteoporosis medications' and 'bisphosphonates', respectively.\r\n\r\nCommon use cases include, but are not limited to:\r\n- Systematic questioning in any consultation related to patterns of medication usage, for example:\r\n--- Do you use paracetamol? Yes, No, Unknown.\r\n--- Have you been using any anticoagulants the last four weeks? Yes, No, Unknown.\r\n\r\nThe semantics of this archetype are intentionally loose, and querying this archetype would normally only be useful or safe within the context of each specific template. In a template, each data element would usually be renamed to the specific question asked. Where value sets have been proposed for common use cases, these can be adapted for local use by using the DV_TEXT or the DV_BOOLEAN datatypes choice to match each specific use case.\r\n\r\nThe EVENT structure from the reference model can be used to specify whether the questions relate to point in time or over a period of time. Use a separate instance of this archetype to distinguish between a questionnaire recording information about a medication that has been used at any time in the past and information about a medication used within a specified time interval - for example the difference between \"Do you drink alcohol?\" compared to \"Have you been drinking any alcohol during the last four weeks?\". \r\n\r\nThe source of the information in a questionnaire response may vary in different contexts but can be specifically identified using the 'Information provider' element in the Reference Model.\r\n\r\nThis archetype has been designed to be used as a screening tool or to record simple questionnaire-format data for use in situations such as a disease registry. If the screening questionnaire identifies the presence of a substance it is recommended that clinical system record and persist the specific details about the substance using a relevant archetype, for example the EVALUATION.tobacco_smoking_summary or the EVALUATION.substance_use_summary. (en)",
          "misuse" : "*Not to be used for recording a summary of use of a substance over the lifetime of the individual - use EVALUATION.substance_use_summary for this purpose.\r\n\r\nNot to be used for recording a summary of use of tobacco over the lifetime of the individual - use EVALUATION.smokeless_tobacco_summary or EVALUATION.tobacco_smoking_summary for this purpose.\r\n\r\nNot to be used for recording a summary of use of alcohol over the lifetime of the individual - use EVALUATION.alcohol_consumption_summary for this purpose.\r\n\r\nNot to be used for recording information about the use of a medication. Use a relevant medication archetype for this purpose.\r\n\r\nNot to be used to record details about a simple selection list where a question may be recorded as either \"present\" or \"indeterminate\". Use OBSERVATION.selection_list for this purpose. (en)",
          "copyright" : "© openEHR Foundation, Nasjonal IKT HF, openEHR Foundation, openEHR Foundation",
          "originalResourceUri" : { },
          "otherDetails" : { }
        }
      }
    },
    "annotations" : {
      "@type" : "RESOURCE_ANNOTATIONS",
      "documentation" : {
        "en" : {
          "/data[at0022]/events[at0023]/data[at0001]/items[at0027.1]" : {
            "redcap_mapping" : "regular_caffeine_suyn"
          },
          "/data[at0022]/events[at0023]/data[at0001]/items[at0026.1]/items[at0024.1]" : {
            "redcap_mapping" : "regular_caff eine_suyn___1"
          },
          "/data[at0022]/events[at0023]/data[at0001]/items[at0026.2]/items[at0024.2]" : {
            "redcap_mapping" : "regular_caff eine_suyn___2"
          },
          "/data[at0022]/events[at0023]/data[at0001]/items[at0026.3]/items[at0024.3]" : {
            "redcap_mapping" : "regular_caff eine_suyn___3"
          },
          "/data[at0022]/events[at0023]/data[at0001]/items[at0026.4]/items[at0024.4]" : {
            "redcap_mapping" : "regular_caff eine_suyn___4"
          }
        }
      }
    },
    "parentArchetypeId" : "openEHR-EHR-OBSERVATION.substance_use_screening.v0",
    "differential" : true,
    "archetypeId" : {
      "@type" : "ARCHETYPE_HRID",
      "value" : "openEHR-EHR-OBSERVATION.ovl-substance_use_screening-001.v0"
    },
    "definition" : {
      "@type" : "C_COMPLEX_OBJECT",
      "rmTypeName" : "OBSERVATION",
      "nodeId" : "at0000.1",
      "attributes" : [ {
        "@type" : "C_ATTRIBUTE",
        "rmAttributeName" : "data",
        "children" : [ {
          "@type" : "C_COMPLEX_OBJECT",
          "rmTypeName" : "HISTORY",
          "nodeId" : "at0022",
          "attributes" : [ {
            "@type" : "C_ATTRIBUTE",
            "rmAttributeName" : "events",
            "children" : [ {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "EVENT",
              "nodeId" : "at0023",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "data",
                "children" : [ {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "ITEM_TREE",
                  "nodeId" : "at0001",
                  "attributes" : [ {
                    "@type" : "C_ATTRIBUTE",
                    "rmAttributeName" : "items",
                    "children" : [ {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "ELEMENT",
                      "occurrences" : "0..0",
                      "nodeId" : "at0040.1",
                      "attributes" : [ {
                        "@type" : "C_ATTRIBUTE",
                        "rmAttributeName" : "value",
                        "children" : [ {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "DV_TEXT",
                          "attributes" : [ {
                            "@type" : "C_ATTRIBUTE",
                            "rmAttributeName" : "value",
                            "children" : [ {
                              "@type" : "C_STRING",
                              "rmTypeName" : "STRING",
                              "constraint" : [ "Caffeine consumption screening for IBD" ]
                            } ]
                          } ],
                          "attributeTuples" : [ ]
                        } ]
                      } ],
                      "attributeTuples" : [ ]
                    }, {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "ELEMENT",
                      "nodeId" : "at0027.1",
                      "attributes" : [ {
                        "@type" : "C_ATTRIBUTE",
                        "rmAttributeName" : "value",
                        "children" : [ {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "DV_CODED_TEXT",
                          "attributes" : [ {
                            "@type" : "C_ATTRIBUTE",
                            "rmAttributeName" : "defining_code",
                            "children" : [ {
                              "@type" : "C_TERMINOLOGY_CODE",
                              "rmTypeName" : "TERMINOLOGY_CODE",
                              "occurrences" : "1..1",
                              "terminologyId" : {
                                "value" : "local"
                              },
                              "constraint" : [ "ac0.4" ],
                              "selectedTerminologies" : [ ]
                            } ]
                          } ],
                          "attributeTuples" : [ ]
                        } ]
                      } ],
                      "attributeTuples" : [ ]
                    }, {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "ELEMENT",
                      "occurrences" : "0..0",
                      "nodeId" : "at0042.1",
                      "attributes" : [ ],
                      "attributeTuples" : [ ]
                    }, {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "CLUSTER",
                      "nodeId" : "at0026.1",
                      "attributes" : [ {
                        "@type" : "C_ATTRIBUTE",
                        "rmAttributeName" : "items",
                        "children" : [ {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "ELEMENT",
                          "nodeId" : "at0021.1",
                          "attributes" : [ {
                            "@type" : "C_ATTRIBUTE",
                            "rmAttributeName" : "value",
                            "children" : [ {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_CODED_TEXT",
                              "occurrences" : "1..1",
                              "defaultValue" : {
                                "defining_code" : {
                                  "terminology_id" : {
                                    "value" : "SNOMED-CT",
                                    "@type" : "TERMINOLOGY_ID"
                                  },
                                  "code_string" : "288456005",
                                  "@type" : "CODE_PHRASE"
                                },
                                "value" : "Caffeinated Coffee",
                                "@type" : "DV_CODED_TEXT"
                              },
                              "attributes" : [ {
                                "@type" : "C_ATTRIBUTE",
                                "rmAttributeName" : "defining_code",
                                "children" : [ {
                                  "@type" : "C_TERMINOLOGY_CODE",
                                  "rmTypeName" : "TERMINOLOGY_CODE",
                                  "occurrences" : "0..1",
                                  "terminologyId" : {
                                    "value" : "SNOMED-CT"
                                  },
                                  "constraint" : [ ],
                                  "selectedTerminologies" : [ "SNOMED-CT" ],
                                  "includedExternalTerminologyCodes" : [ {
                                    "terminologyId" : "SNOMED-CT",
                                    "code" : "288456005",
                                    "value" : "Caffeinated Coffee"
                                  } ]
                                } ]
                              } ],
                              "attributeTuples" : [ ]
                            } ]
                          } ],
                          "attributeTuples" : [ ]
                        }, {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "ELEMENT",
                          "nodeId" : "at0024.1",
                          "attributes" : [ {
                            "@type" : "C_ATTRIBUTE",
                            "rmAttributeName" : "value",
                            "children" : [ {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_CODED_TEXT",
                              "attributes" : [ {
                                "@type" : "C_ATTRIBUTE",
                                "rmAttributeName" : "defining_code",
                                "children" : [ {
                                  "@type" : "C_TERMINOLOGY_CODE",
                                  "rmTypeName" : "CODE_PHRASE",
                                  "occurrences" : "1..1",
                                  "terminologyId" : {
                                    "value" : "local"
                                  },
                                  "constraint" : [ "at0036", "at0037", "at0039" ]
                                } ]
                              } ],
                              "attributeTuples" : [ ]
                            }, {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_TEXT",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            }, {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_BOOLEAN",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            } ]
                          } ],
                          "attributeTuples" : [ ]
                        }, {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "ELEMENT",
                          "occurrences" : "0..0",
                          "nodeId" : "at0003.4",
                          "attributes" : [ {
                            "@type" : "C_ATTRIBUTE",
                            "rmAttributeName" : "value",
                            "children" : [ {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_DATE_TIME",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            }, {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_TEXT",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            } ]
                          } ],
                          "attributeTuples" : [ ]
                        }, {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "ELEMENT",
                          "occurrences" : "0..0",
                          "nodeId" : "at0002.4",
                          "attributes" : [ {
                            "@type" : "C_ATTRIBUTE",
                            "rmAttributeName" : "value",
                            "children" : [ {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_DURATION",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            }, {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_INTERVAL<DV_DURATION>",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            }, {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_TEXT",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            }, {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_DATE_TIME",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            }, {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_INTERVAL<DV_DATE_TIME>",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            } ]
                          } ],
                          "attributeTuples" : [ ]
                        }, {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "ELEMENT",
                          "occurrences" : "0..0",
                          "nodeId" : "at0025.4",
                          "attributes" : [ ],
                          "attributeTuples" : [ ]
                        } ]
                      } ],
                      "attributeTuples" : [ ]
                    }, {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "CLUSTER",
                      "nodeId" : "at0026.2",
                      "attributes" : [ {
                        "@type" : "C_ATTRIBUTE",
                        "rmAttributeName" : "items",
                        "children" : [ {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "ELEMENT",
                          "nodeId" : "at0021.2",
                          "attributes" : [ {
                            "@type" : "C_ATTRIBUTE",
                            "rmAttributeName" : "value",
                            "children" : [ {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_CODED_TEXT",
                              "occurrences" : "1..1",
                              "defaultValue" : {
                                "defining_code" : {
                                  "terminology_id" : {
                                    "value" : "SNOMED-CT",
                                    "@type" : "TERMINOLOGY_ID"
                                  },
                                  "code_string" : "26476000",
                                  "@type" : "CODE_PHRASE"
                                },
                                "value" : "Black tea",
                                "@type" : "DV_CODED_TEXT"
                              },
                              "attributes" : [ {
                                "@type" : "C_ATTRIBUTE",
                                "rmAttributeName" : "defining_code",
                                "children" : [ {
                                  "@type" : "C_TERMINOLOGY_CODE",
                                  "rmTypeName" : "TERMINOLOGY_CODE",
                                  "occurrences" : "0..1",
                                  "terminologyId" : {
                                    "value" : "SNOMED-CT"
                                  },
                                  "constraint" : [ ],
                                  "selectedTerminologies" : [ "SNOMED-CT" ],
                                  "includedExternalTerminologyCodes" : [ {
                                    "terminologyId" : "SNOMED-CT",
                                    "code" : "26476000",
                                    "value" : "Black tea"
                                  } ]
                                } ]
                              } ],
                              "attributeTuples" : [ ]
                            } ]
                          } ],
                          "attributeTuples" : [ ]
                        }, {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "ELEMENT",
                          "nodeId" : "at0024.2",
                          "attributes" : [ {
                            "@type" : "C_ATTRIBUTE",
                            "rmAttributeName" : "value",
                            "children" : [ {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_CODED_TEXT",
                              "attributes" : [ {
                                "@type" : "C_ATTRIBUTE",
                                "rmAttributeName" : "defining_code",
                                "children" : [ {
                                  "@type" : "C_TERMINOLOGY_CODE",
                                  "rmTypeName" : "CODE_PHRASE",
                                  "occurrences" : "1..1",
                                  "terminologyId" : {
                                    "value" : "local"
                                  },
                                  "constraint" : [ "at0036", "at0037", "at0039" ]
                                } ]
                              } ],
                              "attributeTuples" : [ ]
                            }, {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_TEXT",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            }, {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_BOOLEAN",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            } ]
                          } ],
                          "attributeTuples" : [ ]
                        }, {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "ELEMENT",
                          "occurrences" : "0..0",
                          "nodeId" : "at0003.3",
                          "attributes" : [ {
                            "@type" : "C_ATTRIBUTE",
                            "rmAttributeName" : "value",
                            "children" : [ {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_DATE_TIME",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            }, {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_TEXT",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            } ]
                          } ],
                          "attributeTuples" : [ ]
                        }, {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "ELEMENT",
                          "occurrences" : "0..0",
                          "nodeId" : "at0002.3",
                          "attributes" : [ {
                            "@type" : "C_ATTRIBUTE",
                            "rmAttributeName" : "value",
                            "children" : [ {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_DURATION",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            }, {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_INTERVAL<DV_DURATION>",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            }, {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_TEXT",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            }, {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_DATE_TIME",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            }, {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_INTERVAL<DV_DATE_TIME>",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            } ]
                          } ],
                          "attributeTuples" : [ ]
                        }, {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "ELEMENT",
                          "occurrences" : "0..0",
                          "nodeId" : "at0025.2",
                          "attributes" : [ ],
                          "attributeTuples" : [ ]
                        } ]
                      } ],
                      "attributeTuples" : [ ]
                    }, {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "CLUSTER",
                      "nodeId" : "at0026.3",
                      "attributes" : [ {
                        "@type" : "C_ATTRIBUTE",
                        "rmAttributeName" : "items",
                        "children" : [ {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "ELEMENT",
                          "nodeId" : "at0021.3",
                          "attributes" : [ {
                            "@type" : "C_ATTRIBUTE",
                            "rmAttributeName" : "value",
                            "children" : [ {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_CODED_TEXT",
                              "occurrences" : "1..1",
                              "defaultValue" : {
                                "defining_code" : {
                                  "terminology_id" : {
                                    "value" : "SNOMED-CT",
                                    "@type" : "TERMINOLOGY_ID"
                                  },
                                  "code_string" : "412194001",
                                  "@type" : "CODE_PHRASE"
                                },
                                "value" : "Green tea",
                                "@type" : "DV_CODED_TEXT"
                              },
                              "attributes" : [ {
                                "@type" : "C_ATTRIBUTE",
                                "rmAttributeName" : "defining_code",
                                "children" : [ {
                                  "@type" : "C_TERMINOLOGY_CODE",
                                  "rmTypeName" : "TERMINOLOGY_CODE",
                                  "occurrences" : "0..1",
                                  "terminologyId" : {
                                    "value" : "SNOMED-CT"
                                  },
                                  "constraint" : [ ],
                                  "selectedTerminologies" : [ "SNOMED-CT" ],
                                  "includedExternalTerminologyCodes" : [ {
                                    "terminologyId" : "SNOMED-CT",
                                    "code" : "412194001",
                                    "value" : "Green tea"
                                  } ]
                                } ]
                              } ],
                              "attributeTuples" : [ ]
                            } ]
                          } ],
                          "attributeTuples" : [ ]
                        }, {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "ELEMENT",
                          "nodeId" : "at0024.3",
                          "attributes" : [ {
                            "@type" : "C_ATTRIBUTE",
                            "rmAttributeName" : "value",
                            "children" : [ {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_CODED_TEXT",
                              "attributes" : [ {
                                "@type" : "C_ATTRIBUTE",
                                "rmAttributeName" : "defining_code",
                                "children" : [ {
                                  "@type" : "C_TERMINOLOGY_CODE",
                                  "rmTypeName" : "CODE_PHRASE",
                                  "occurrences" : "1..1",
                                  "terminologyId" : {
                                    "value" : "local"
                                  },
                                  "constraint" : [ "at0036", "at0037", "at0039" ]
                                } ]
                              } ],
                              "attributeTuples" : [ ]
                            }, {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_TEXT",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            }, {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_BOOLEAN",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            } ]
                          } ],
                          "attributeTuples" : [ ]
                        }, {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "ELEMENT",
                          "occurrences" : "0..0",
                          "nodeId" : "at0003.2",
                          "attributes" : [ {
                            "@type" : "C_ATTRIBUTE",
                            "rmAttributeName" : "value",
                            "children" : [ {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_DATE_TIME",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            }, {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_TEXT",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            } ]
                          } ],
                          "attributeTuples" : [ ]
                        }, {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "ELEMENT",
                          "occurrences" : "0..0",
                          "nodeId" : "at0002.2",
                          "attributes" : [ {
                            "@type" : "C_ATTRIBUTE",
                            "rmAttributeName" : "value",
                            "children" : [ {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_DURATION",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            }, {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_INTERVAL<DV_DURATION>",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            }, {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_TEXT",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            }, {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_DATE_TIME",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            }, {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_INTERVAL<DV_DATE_TIME>",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            } ]
                          } ],
                          "attributeTuples" : [ ]
                        }, {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "ELEMENT",
                          "occurrences" : "0..0",
                          "nodeId" : "at0025.3",
                          "attributes" : [ ],
                          "attributeTuples" : [ ]
                        } ]
                      } ],
                      "attributeTuples" : [ ]
                    }, {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "CLUSTER",
                      "nodeId" : "at0026.4",
                      "attributes" : [ {
                        "@type" : "C_ATTRIBUTE",
                        "rmAttributeName" : "items",
                        "children" : [ {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "ELEMENT",
                          "nodeId" : "at0021.4",
                          "attributes" : [ {
                            "@type" : "C_ATTRIBUTE",
                            "rmAttributeName" : "value",
                            "children" : [ {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_CODED_TEXT",
                              "occurrences" : "1..1",
                              "defaultValue" : {
                                "defining_code" : {
                                  "terminology_id" : {
                                    "value" : "SNOMED-CT",
                                    "@type" : "TERMINOLOGY_ID"
                                  },
                                  "code_string" : "288458006",
                                  "@type" : "CODE_PHRASE"
                                },
                                "value" : "Caffeinated soft drinks",
                                "@type" : "DV_CODED_TEXT"
                              },
                              "attributes" : [ {
                                "@type" : "C_ATTRIBUTE",
                                "rmAttributeName" : "defining_code",
                                "children" : [ {
                                  "@type" : "C_TERMINOLOGY_CODE",
                                  "rmTypeName" : "TERMINOLOGY_CODE",
                                  "occurrences" : "0..1",
                                  "terminologyId" : {
                                    "value" : "SNOMED-CT"
                                  },
                                  "constraint" : [ ],
                                  "selectedTerminologies" : [ "SNOMED-CT" ],
                                  "includedExternalTerminologyCodes" : [ {
                                    "terminologyId" : "SNOMED-CT",
                                    "code" : "288458006",
                                    "value" : "Caffeinated soft drinks"
                                  } ]
                                } ]
                              } ],
                              "attributeTuples" : [ ]
                            } ]
                          } ],
                          "attributeTuples" : [ ]
                        }, {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "ELEMENT",
                          "nodeId" : "at0024.4",
                          "attributes" : [ {
                            "@type" : "C_ATTRIBUTE",
                            "rmAttributeName" : "value",
                            "children" : [ {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_CODED_TEXT",
                              "attributes" : [ {
                                "@type" : "C_ATTRIBUTE",
                                "rmAttributeName" : "defining_code",
                                "children" : [ {
                                  "@type" : "C_TERMINOLOGY_CODE",
                                  "rmTypeName" : "CODE_PHRASE",
                                  "occurrences" : "1..1",
                                  "terminologyId" : {
                                    "value" : "local"
                                  },
                                  "constraint" : [ "at0036", "at0037", "at0039" ]
                                } ]
                              } ],
                              "attributeTuples" : [ ]
                            }, {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_TEXT",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            }, {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_BOOLEAN",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            } ]
                          } ],
                          "attributeTuples" : [ ]
                        }, {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "ELEMENT",
                          "occurrences" : "0..0",
                          "nodeId" : "at0003.1",
                          "attributes" : [ {
                            "@type" : "C_ATTRIBUTE",
                            "rmAttributeName" : "value",
                            "children" : [ {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_DATE_TIME",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            }, {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_TEXT",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            } ]
                          } ],
                          "attributeTuples" : [ ]
                        }, {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "ELEMENT",
                          "occurrences" : "0..0",
                          "nodeId" : "at0002.1",
                          "attributes" : [ {
                            "@type" : "C_ATTRIBUTE",
                            "rmAttributeName" : "value",
                            "children" : [ {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_DURATION",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            }, {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_INTERVAL<DV_DURATION>",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            }, {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_TEXT",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            }, {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_DATE_TIME",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            }, {
                              "@type" : "C_COMPLEX_OBJECT",
                              "rmTypeName" : "DV_INTERVAL<DV_DATE_TIME>",
                              "attributes" : [ ],
                              "attributeTuples" : [ ]
                            } ]
                          } ],
                          "attributeTuples" : [ ]
                        }, {
                          "@type" : "C_COMPLEX_OBJECT",
                          "rmTypeName" : "ELEMENT",
                          "occurrences" : "0..0",
                          "nodeId" : "at0025.1",
                          "attributes" : [ ],
                          "attributeTuples" : [ ]
                        } ]
                      } ],
                      "attributeTuples" : [ ]
                    } ]
                  } ],
                  "attributeTuples" : [ ]
                } ]
              } ],
              "attributeTuples" : [ ]
            } ]
          } ],
          "attributeTuples" : [ ]
        } ]
      } ],
      "attributeTuples" : [ ]
    },
    "terminology" : {
      "@type" : "ARCHETYPE_TERMINOLOGY",
      "conceptCode" : "at0000",
      "termDefinitions" : {
        "en" : {
          "at0000.1" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0000.1",
            "text" : "Substance use screening - caffeine",
            "description" : "Series of questions and associated answers used to screen for the harmful or hazardous use of medications, and other legal and illegal substances.",
            "comment" : "Also known as substance abuse, and includes substance dependence, addiction and doping. Examples of substances include, but are not limited to, alcohol, tobacco, amphetamines, barbiturates, benzodiazepines, cannabis, cocaine, hallucinogens, opioids, anabolic steroids, erythropoietin, or sniffing glue."
          },
          "at0027.1" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0027.1",
            "text" : "In your lifetime, have you ever regularly drunk caffeinated drink, that is, at least once per week for 6 months or longer?",
            "description" : "Is there a history of use of any substance related to the screening purpose?",
            "comment" : "In a template, the data element would usually be renamed to the specific question asked. The proposed value set can be adapted for local use by using the DV_TEXT or the DV_BOOLEAN datatypes choice to match each specific use case."
          },
          "at0024.1" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0024.1",
            "text" : "Consumed caffeinated coffee?",
            "description" : "Is there a history of use of a specific substance or group of substances.",
            "comment" : "In a template, the data element would usually be renamed to the specific question asked. The proposed value set can be adapted for local use by using the DV_TEXT or the DV_BOOLEAN datatypes choice to match each specific use case. For example an alternative valueset using the DV_TEXT datatype can be: Currently using [The individual currently uses the specific substance either on a regular basis or as required.] Never used [The individual has never used the specific substance.] Used in the past [The individual has used the specific substance in the past, but isn't currently using it.] Unknown [It is not known whether the individual uses or has used the specific substance.]"
          },
          "at0026.1" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0026.1",
            "text" : "Specific substance - coffee",
            "description" : "Details about a specified substance or grouping of substances relevant for the screening purpose.",
            "comment" : "Use separate instances of this CLUSTER to differentiate between specific substances or groupings of substance."
          },
          "at0026.2" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0026.2",
            "text" : "Specific substance - black tea",
            "description" : "Details about a specified substance or grouping of substances relevant for the screening purpose.",
            "comment" : "Use separate instances of this CLUSTER to differentiate between specific substances or groupings of substance."
          },
          "at0024.2" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0024.2",
            "text" : "Consumed caffeinated black tea?",
            "description" : "Is there a history of use of a specific substance or group of substances.",
            "comment" : "In a template, the data element would usually be renamed to the specific question asked. The proposed value set can be adapted for local use by using the DV_TEXT or the DV_BOOLEAN datatypes choice to match each specific use case. For example an alternative valueset using the DV_TEXT datatype can be: Currently using [The individual currently uses the specific substance either on a regular basis or as required.] Never used [The individual has never used the specific substance.] Used in the past [The individual has used the specific substance in the past, but isn't currently using it.] Unknown [It is not known whether the individual uses or has used the specific substance.]"
          },
          "at0026.3" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0026.3",
            "text" : "Specific substance - green tea",
            "description" : "Details about a specified substance or grouping of substances relevant for the screening purpose.",
            "comment" : "Use separate instances of this CLUSTER to differentiate between specific substances or groupings of substance."
          },
          "at0024.3" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0024.3",
            "text" : "Consumed caffeinated green tea?",
            "description" : "Is there a history of use of a specific substance or group of substances.",
            "comment" : "In a template, the data element would usually be renamed to the specific question asked. The proposed value set can be adapted for local use by using the DV_TEXT or the DV_BOOLEAN datatypes choice to match each specific use case. For example an alternative valueset using the DV_TEXT datatype can be: Currently using [The individual currently uses the specific substance either on a regular basis or as required.] Never used [The individual has never used the specific substance.] Used in the past [The individual has used the specific substance in the past, but isn't currently using it.] Unknown [It is not known whether the individual uses or has used the specific substance.]"
          },
          "at0026.4" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0026.4",
            "text" : "Specific substance - soda",
            "description" : "Details about a specified substance or grouping of substances relevant for the screening purpose.",
            "comment" : "Use separate instances of this CLUSTER to differentiate between specific substances or groupings of substance."
          },
          "at0024.4" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0024.4",
            "text" : "Consumed caffeinated soda?",
            "description" : "Is there a history of use of a specific substance or group of substances.",
            "comment" : "In a template, the data element would usually be renamed to the specific question asked. The proposed value set can be adapted for local use by using the DV_TEXT or the DV_BOOLEAN datatypes choice to match each specific use case. For example an alternative valueset using the DV_TEXT datatype can be: Currently using [The individual currently uses the specific substance either on a regular basis or as required.] Never used [The individual has never used the specific substance.] Used in the past [The individual has used the specific substance in the past, but isn't currently using it.] Unknown [It is not known whether the individual uses or has used the specific substance.]"
          },
          "ac0.4" : {
            "@type" : "ARCHETYPE_TERM",
            "text" : "(Synthesized)",
            "code" : "ac0.4",
            "description" : ""
          }
        },
        "nb" : {
          "at0026.2" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0026.1",
            "text" : "Spesifikk substans (2)",
            "description" : "Detaljer om en spesifikk substans eller gruppe av substanser er innenfor kartleggingsformålet.",
            "comment" : "Bruk separate instanser av dette clusteret for å skille mellom spesifikke substanser eller grupper av substanser."
          },
          "at0026.3" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0026.1",
            "text" : "Spesifikk substans (3)",
            "description" : "Detaljer om en spesifikk substans eller gruppe av substanser er innenfor kartleggingsformålet.",
            "comment" : "Bruk separate instanser av dette clusteret for å skille mellom spesifikke substanser eller grupper av substanser."
          },
          "at0026.4" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0026.1",
            "text" : "Spesifikk substans (4)",
            "description" : "Detaljer om en spesifikk substans eller gruppe av substanser er innenfor kartleggingsformålet.",
            "comment" : "Bruk separate instanser av dette clusteret for å skille mellom spesifikke substanser eller grupper av substanser."
          },
          "ac0.4" : {
            "@type" : "ARCHETYPE_TERM",
            "text" : "*(Synthesized) (en)",
            "code" : "ac0.4",
            "description" : ""
          }
        },
        "de" : {
          "at0026.2" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0026.1",
            "text" : "*Specific substance (en) (2)",
            "description" : "*Details about a specified substance or grouping of substances relevant for the screening purpose. (en)",
            "comment" : "*Use separate instances of this CLUSTER to differentiate between specific substances or groupings of substance. (en)"
          },
          "at0026.3" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0026.1",
            "text" : "*Specific substance (en) (3)",
            "description" : "*Details about a specified substance or grouping of substances relevant for the screening purpose. (en)",
            "comment" : "*Use separate instances of this CLUSTER to differentiate between specific substances or groupings of substance. (en)"
          },
          "at0026.4" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0026.1",
            "text" : "*Specific substance (en) (4)",
            "description" : "*Details about a specified substance or grouping of substances relevant for the screening purpose. (en)",
            "comment" : "*Use separate instances of this CLUSTER to differentiate between specific substances or groupings of substance. (en)"
          },
          "ac0.4" : {
            "@type" : "ARCHETYPE_TERM",
            "text" : "*(Synthesized) (en)",
            "code" : "ac0.4",
            "description" : ""
          }
        },
        "nl" : {
          "at0026.2" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0026.1",
            "text" : "*Specific substance (en) (2)",
            "description" : "*Details about a specified substance or grouping of substances relevant for the screening purpose. (en)",
            "comment" : "*Use separate instances of this CLUSTER to differentiate between specific substances or groupings of substance. (en)"
          },
          "at0026.3" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0026.1",
            "text" : "*Specific substance (en) (3)",
            "description" : "*Details about a specified substance or grouping of substances relevant for the screening purpose. (en)",
            "comment" : "*Use separate instances of this CLUSTER to differentiate between specific substances or groupings of substance. (en)"
          },
          "at0026.4" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0026.1",
            "text" : "*Specific substance (en) (4)",
            "description" : "*Details about a specified substance or grouping of substances relevant for the screening purpose. (en)",
            "comment" : "*Use separate instances of this CLUSTER to differentiate between specific substances or groupings of substance. (en)"
          },
          "ac0.4" : {
            "@type" : "ARCHETYPE_TERM",
            "text" : "*(Synthesized) (en)",
            "code" : "ac0.4",
            "description" : ""
          }
        }
      },
      "termBindings" : { },
      "terminologyExtracts" : { },
      "valueSets" : {
        "ac0.1" : {
          "@type" : "VALUE_SET",
          "id" : "ac0.1",
          "members" : [ "at0028", "at0029", "at0030" ]
        },
        "ac0.2" : {
          "@type" : "VALUE_SET",
          "id" : "ac0.2",
          "members" : [ "at0028", "at0029", "at0030" ]
        },
        "ac0.3" : {
          "@type" : "VALUE_SET",
          "id" : "ac0.3",
          "members" : [ "at0028", "at0029", "at0030" ]
        },
        "ac0.4" : {
          "@type" : "VALUE_SET",
          "id" : "ac0.4",
          "members" : [ "at0028", "at0029", "at0030" ]
        }
      }
    },
    "adlVersion" : "1.4",
    "buildUid" : "4a3703b7-5817-4527-9c1e-a22eb5f51a8e",
    "rmName" : "openehr",
    "rmRelease" : "1.1.0",
    "generated" : true,
    "otherMetaData" : { },
    "originalLanguage" : {
      "terminologyId" : {
        "value" : "ISO_639-1"
      },
      "codeString" : "en"
    },
    "translations" : [ {
      "@type" : "TRANSLATION_DETAILS",
      "language" : {
        "terminologyId" : {
          "value" : "ISO_639-1"
        },
        "codeString" : "de"
      },
      "author" : {
        "name" : "Kim Sommer, Natalia Strauch, Alina Rehberg",
        "organisation" : "Medizinische Hochschule Hannover",
        "email" : "sommer.kimkatrin@mh-hannover.de, Strauch.Natalia@mh-hannover.de, rehberg.alina@mh-hannover.de"
      },
      "otherDetails" : { }
    }, {
      "@type" : "TRANSLATION_DETAILS",
      "language" : {
        "terminologyId" : {
          "value" : "ISO_639-1"
        },
        "codeString" : "nb"
      },
      "author" : {
        "name" : "Silje Ljosland Bakke, Marit Alice Venheim, John Tore Valand",
        "organisation" : "Helse Vest IKT AS, Helse Bergen",
        "email" : "silje.ljosland.bakke@helse-vest-ikt.no, marit.alice.venheim@helse-vest-ikt.no, john.tore.valand@helse-bergen.no, john.tore.valand@helse-vest-ikt.no"
      },
      "otherDetails" : { }
    }, {
      "@type" : "TRANSLATION_DETAILS",
      "language" : {
        "terminologyId" : {
          "value" : "ISO_639-1"
        },
        "codeString" : "nl"
      },
      "author" : {
        "name" : "Martijn van Eenennaam",
        "organisation" : "Nedap Healthcare",
        "email" : "martijn.vaneenennaam@nedap.com"
      },
      "accreditation" : "PhD",
      "otherDetails" : { }
    } ]
  } ],
  "originalLanguage" : {
    "terminologyId" : {
      "value" : "ISO_639-1"
    },
    "codeString" : "en"
  },
  "translations" : [ {
    "@type" : "TRANSLATION_DETAILS",
    "language" : {
      "terminologyId" : {
        "value" : "ISO_639-1"
      },
      "codeString" : "de"
    },
    "author" : { },
    "otherDetails" : { }
  }, {
    "@type" : "TRANSLATION_DETAILS",
    "language" : {
      "terminologyId" : {
        "value" : "ISO_639-1"
      },
      "codeString" : "ru"
    },
    "author" : { },
    "otherDetails" : { }
  }, {
    "@type" : "TRANSLATION_DETAILS",
    "language" : {
      "terminologyId" : {
        "value" : "ISO_639-1"
      },
      "codeString" : "sv"
    },
    "author" : { },
    "otherDetails" : { }
  }, {
    "@type" : "TRANSLATION_DETAILS",
    "language" : {
      "terminologyId" : {
        "value" : "ISO_639-1"
      },
      "codeString" : "es-ar"
    },
    "author" : { },
    "otherDetails" : { }
  }, {
    "@type" : "TRANSLATION_DETAILS",
    "language" : {
      "terminologyId" : {
        "value" : "ISO_639-1"
      },
      "codeString" : "nb"
    },
    "author" : { },
    "otherDetails" : { }
  }, {
    "@type" : "TRANSLATION_DETAILS",
    "language" : {
      "terminologyId" : {
        "value" : "ISO_639-1"
      },
      "codeString" : "pt-br"
    },
    "author" : { },
    "otherDetails" : { }
  }, {
    "@type" : "TRANSLATION_DETAILS",
    "language" : {
      "terminologyId" : {
        "value" : "ISO_639-1"
      },
      "codeString" : "sl"
    },
    "author" : { },
    "otherDetails" : { }
  }, {
    "@type" : "TRANSLATION_DETAILS",
    "language" : {
      "terminologyId" : {
        "value" : "ISO_639-1"
      },
      "codeString" : "it"
    },
    "author" : { },
    "otherDetails" : { }
  }, {
    "@type" : "TRANSLATION_DETAILS",
    "language" : {
      "terminologyId" : {
        "value" : "ISO_639-1"
      },
      "codeString" : "fr"
    },
    "author" : { },
    "otherDetails" : { }
  } ]
}